{"Option B<--xlate> calls B<--xlate-color> option with B<--color=never> option.\n":"L'option B<--xlate> appelle l'option B<--xlate-color> avec l'option B<--color=never>.\n","You can use C<-Mupdate> module to modify files by the result of B<greple> command.\n":"Vous pouvez utiliser le module C<-Mupdate> pour modifier les fichiers par le résultat de la commande B<greple>.\n","By default behavior, unused data is removed from cache file. If you don't want to remove them and keep in the file, use C<accumulate>.\n":"Par défaut, les données inutilisées sont supprimées du fichier cache. Si vous ne voulez pas les supprimer et les conserver dans le fichier, utilisez C<accumulate>.\n","With B<--xlate-fold> option, converted text is folded by the specified width. Default width is 70 and can be set by B<--xlate-fold-width> option. Four columns are reserved for run-in operation, so each line could hold 74 characters at most.\n":"Avec l'option B<--xlate-fold>, le texte converti est plié selon la largeur spécifiée. La largeur par défaut est de 70 et peut être définie par l'option B<--xlate-fold-width>. Quatre colonnes sont réservées à l'opération de rodage, de sorte que chaque ligne peut contenir 74 caractères au maximum.\n","Set your authentication key for DeepL service.\n":"Définissez votre clé d'authentification pour le service DeepL.\n","If the format is C<none> or unkown, only translated text is printed.\n":"Si le format est C<none> ou unkown, seul le texte traduit est imprimé.\n","Then add C<--xlate> option to translate the selected area. It will find and replace them by the B<deepl> command output.\n":"Ensuite, ajoutez l'option C<--xlate> pour traduire la zone sélectionnée. Elle les trouvera et les remplacera par la sortie de la commande B<deepl>.\n","If you want to translate normal text block in L<pod> style document, use B<greple> command with C<xlate::deepl> and C<perl> module like this:\n":"Si vous voulez traduire un bloc de texte normal dans un document de style L<pod>, utilisez la commande B<greple> avec le module C<xlate::deepl> et C<perl> comme ceci :\n","B<Greple> B<xlate> module find text blocks and replace them by the translated text. Currently only DeepL service is supported by the B<xlate::deepl> module.\n":"Le module B<Greple> B<xlate> trouve des blocs de texte et les remplace par le texte traduit. Actuellement, seul le service DeepL est pris en charge par le module B<xlate::deepl>.\n","Insted of calling translation engine, you are expected to work for. After preparing text to be translated, they are copied to the clipboard. You are expected to paste them to the form, copy the result to the clipboard, and hit return.\n":"Au lieu d'appeler le moteur de traduction, vous êtes censé travailler pour. Après avoir préparé les textes à traduire, ils sont copiés dans le presse-papiers. Vous êtes censé les coller dans le formulaire, copier le résultat dans le presse-papiers et appuyer sur la touche retour.\n","If you want to translate entire text, use B<--match-entire> option. This is a short-cut to specify the pattern matches entire text C<(?s).*>.\n":"Si vous voulez traduire un texte entier, utilisez l'option B<--match-entire>. Il s'agit d'un raccourci pour spécifier que le motif correspond au texte entier C<(?s).*>.\n","Specify the output format for original and translated text.\n":"Spécifiez le format de sortie pour le texte original et le texte traduit.\n","Print original and translated text in L<cpp(1)> C<#ifdef> format.\n":"Impression du texte original et du texte traduit au format C<#ifdef> de L<cpp(1)>.\n","Use B<sdif> to show conflict marker format side by side with B<-V> option.\n":"Utilisez B<sdif> pour afficher le format des marqueurs de conflit côte à côte avec l'option B<-V>.\n","Print original and translated text separated by single blank line.\n":"Imprimer le texte original et le texte traduit séparés par une seule ligne blanche.\n","Invoke the translation process for each matched area.\n":"Invoquez le processus de traduction pour chaque zone appariée.\n","You can recover the original file by next L<sed(1)> command.\n":"Vous pouvez récupérer le fichier original par la commande L<sed(1)> suivante.\n","Specify the target language. You can get available languages by C<deepl languages> command when using B<DeepL> engine.\n":"Spécifiez la langue cible. Vous pouvez obtenir les langues disponibles par la commande C<deepl languages> lorsque vous utilisez le moteur B<DeepL>.\n","By default, original and translated text is printed in the \"conflict marker\" format compatible with L<git(1)>. Using C<ifdef> format, you can get desired part by L<unifdef(1)> command easily. Format can be specified by B<--xlate-format> option.\n":"Par défaut, le texte original et traduit est imprimé dans le format \"marqueur de conflit\" compatible avec L<git(1)>. En utilisant le format C<ifdef>, vous pouvez obtenir facilement la partie souhaitée par la commande L<unifdef(1)>. Le format peut être spécifié par l'option B<--xlate-format>.\n","Without this option, B<greple> behaves as a normal search command. So you can check which part of the file will be subject of the translation before invoking actual work.\n":"Sans cette option, B<greple> se comporte comme une commande de recherche normale. Vous pouvez donc vérifier quelle partie du fichier fera l'objet de la traduction avant d'invoquer le travail réel.\n","Command result goes to standard out, so redirect to file if necessary, or consider to use L<App::Greple::update> module.\n":"Le résultat de la commande va vers la sortie standard, donc redirigez vers le fichier si nécessaire, ou envisagez d'utiliser le module L<App::Greple::update>.\n","B<xlate> module can store cached text of translation for each file and read it before execution to eliminate the overhead of asking to server. With the default cache strategy C<auto>, it maintains cache data only when the cache file exists for target file.\n":"Le module B<xlate> peut stocker le texte de la traduction en cache pour chaque fichier et le lire avant l'exécution pour éliminer les frais généraux de demande au serveur. Avec la stratégie de cache par défaut C<auto>, il maintient les données de cache uniquement lorsque le fichier de cache existe pour le fichier cible.\n","Specify the translation engine to be used. You don't have to use this option because module C<xlate::deepl> declares it as C<--xlate-engine=deepl>.\n":"Spécifiez le moteur de traduction à utiliser. Vous n'avez pas à utiliser cette option car le module C<xlate::deepl> le déclare comme C<--xlate-engine=deepl>.\n","Set the whole text of the file as a target area.\n":"Définissez l'ensemble du texte du fichier comme zone cible.\n","Maintain cache anyway as far as the target is normal file.\n":"Maintenir le cache de toute façon tant que la cible est un fichier normal.\n","See the B<greple> manual for the detail about target text pattern. Use B<--inside>, B<--outside>, B<--include>, B<--exclude> options to limit the matching area.\n":"Voir le manuel B<greple> pour les détails sur le modèle de texte cible. Utilisez les options B<--inside>, B<--outside>, B<--include>, B<--exclude> pour limiter la zone de correspondance.\n","See the tranlsation result in real time in the STDERR output.\n":"Voir le résultat de la traduction en temps réel dans la sortie STDERR.\n","The <--refresh> option can be used to initiate cache management or to refresh all existing cache data. Once executed with this option, a new cache file will be created if one does not exist and then automatically maintained afterward.\n":"L'option <--refresh> peut être utilisée pour lancer la gestion du cache ou pour rafraîchir toutes les données du cache existantes. Une fois exécutée avec cette option, un nouveau fichier de cache sera créé s'il n'en existe pas, puis automatiquement maintenu par la suite.\n","Never use cache file even if it exists.\n":"Ne jamais utiliser le fichier cache même s'il existe.\n","Maintain cache but don't read existing one.\n":"Maintenir le cache mais ne pas lire celui existant.\n","Maintain cache file if it exists.\n":"Maintient le fichier de cache s'il existe.\n","DeepL Python library and CLI command.\n":"DeepL Bibliothèque Python et commande CLI.\n","Pattern C<^(\\w.*\\n)+> means consecutive lines starting with alpha-numeric letter. This command show the area to be translated. Option B<--all> is used to produce entire text.\n":"Le motif C<^(\\w.*\\n)+> signifie des lignes consécutives commençant par une lettre alpha-numérique. Cette commande montre la zone à traduire. L'option B<--all> est utilisée pour produire le texte entier.\n","Print original and translated text in L<git(1)> conflict marker format.\n":"Imprimez le texte original et traduit au format de marqueur de conflit L<git(1)>.\n","Create empty cache file and exit.\n":"Créer un fichier cache vide et quitter.\n","You can retrieve only Japanese text by the B<unifdef> command:\n":"Vous pouvez récupérer uniquement le texte japonais par la commande B<unifdef> :\n","App::Greple::xlate - translation support module for greple\n":"App::Greple::xlate - module d'aide à la traduction pour greple\n"}