{"Create empty cache file and exit.\n":"创建空缓存文件并退出。\n","Without this option, B<greple> behaves as a normal search command. So you can check which part of the file will be subject of the translation before invoking actual work.\n":"如果没有这个选项，B<greple>的行为就像一个普通的搜索命令。所以你可以在调用实际工作之前检查文件的哪一部分将成为翻译的对象。\n","B<Greple> B<xlate> module find text blocks and replace them by the translated text. Currently only DeepL service is supported by the B<xlate::deepl> module.\n":"B<Greple> B<xlate>模块找到文本块，并用翻译后的文本替换它们。目前B<xlate::deepl>模块只支持DeepL 服务。\n","You can retrieve only Japanese text by the B<unifdef> command:\n":"你可以通过B<unifdef>命令只检索日文文本。\n","By default, original and translated text is printed in the \"conflict marker\" format compatible with L<git(1)>. Using C<ifdef> format, you can get desired part by L<unifdef(1)> command easily. Format can be specified by B<--xlate-format> option.\n":"默认情况下，原始文本和翻译文本是以与L<git(1)>兼容的 \"冲突标记 \"格式打印的。使用 C<ifdef> 格式，你可以通过 L<unifdef(1)> 命令轻松获得所需的部分。格式可以由B<--xlate-format>选项指定。\n","B<xlate> module can store cached text of translation for each file and read it before execution to eliminate the overhead of asking to server. With the default cache strategy C<auto>, it maintains cache data only when the cache file exists for target file.\n":"B<xlate>模块可以存储每个文件的翻译缓存文本，并在执行前读取它，以消除向服务器请求的开销。在默认的缓存策略C<auto>下，它只在目标文件的缓存文件存在时才维护缓存数据。\n","See the B<greple> manual for the detail about target text pattern. Use B<--inside>, B<--outside>, B<--include>, B<--exclude> options to limit the matching area.\n":"关于目标文本模式的细节，请参见B<greple>手册。使用B<--inside>, B<--outside>, B<--include>, B<--exclude>选项来限制匹配区域。\n","L<App::Greple::xlate>\n":"L<App::Greple::xlate>\n","Never use cache file even if it exists.\n":"即使缓存文件存在，也不使用它。\n","DeepL Python library and CLI command.\n":"DeepL Python库和CLI命令。\n","If the format is C<none> or unkown, only translated text is printed.\n":"如果格式是C<none>或不知道，则只打印翻译的文本。\n","Specify the target language. You can get available languages by C<deepl languages> command when using B<DeepL> engine.\n":"指定目标语言。当使用B<DeepL>引擎时，你可以通过C<deepl languages>命令获得可用语言。\n","You can use C<-Mupdate> module to modify files by the result of B<greple> command.\n":"你可以使用C<-Mupdate>模块通过B<greple>命令的结果来修改文件。\n","Maintain cache anyway as far as the target is normal file.\n":"只要目标文件是正常文件，就维持缓存。\n","Print original and translated text in L<git(1)> conflict marker format.\n":"以L<git(1)>冲突标记格式打印原始和翻译文本。\n","Specify the translation engine to be used. You don't have to use this option because module C<xlate::deepl> declares it as C<--xlate-engine=deepl>.\n":"指定要使用的翻译引擎。你不必使用这个选项，因为模块C<xlate::deepl>将它声明为C<--xlate-engine=deepl>。\n","You can recover the original file by next L<sed(1)> command.\n":"你可以通过下一个L<sed(1)>命令恢复原始文件。\n","Invoke the translation process for each matched area.\n":"对每个匹配的区域调用翻译过程。\n","By default behavior, unused data is removed from the cache file. If you don't want to remove them and keep in the file, use C<accumulate>.\n":"根据默认行为，未使用的数据会从缓存文件中删除。如果你不想删除它们并保留在文件中，使用C<accumulate>。\n","Insted of calling translation engine, you are expected to work for. After preparing text to be translated, they are copied to the clipboard. You are expected to paste them to the form, copy the result to the clipboard, and hit return.\n":"与其说是调用翻译引擎，不如说是希望你能为之工作。在准备好要翻译的文本后，它们被复制到剪贴板上。你应该把它们粘贴到表格中，把结果复制到剪贴板上，然后点击返回。\n","If you want to translate normal text block in L<pod> style document, use B<greple> command with C<xlate::deepl> and C<perl> module like this:\n":"如果你想翻译L<pod>风格文档中的普通文本块，可以像这样使用B<greple>命令与C<xlate::deepl>和C<perl>模块。\n","Pattern C<^(\\w.*\\n)+> means consecutive lines starting with alpha-numeric letter. This command show the area to be translated. Option B<--all> is used to produce entire text.\n":"模式C<^(\\w.*\\n)+>表示以字母-数字开头的连续行。这个命令显示要翻译的区域。选项B<--all>用于生成整个文本。\n","The B<--cache-clear> option can be used to initiate cache management or to refresh all existing cache data. Once executed with this option, a new cache file will be created if one does not exist and then automatically maintained afterward.\n":"B<--cache-clear>选项可以用来启动缓冲区管理或刷新所有现有的缓冲区数据。一旦用这个选项执行，如果不存在一个新的缓存文件，就会创建一个新的缓存文件，然后自动维护。\n","Maintain the cache file if it exists.\n":"如果缓存文件存在，则维护该文件。\n","Option B<--xlate> calls B<--xlate-color> option with B<--color=never> option.\n":"选项B<--xlate>调用B<--xlate-color>选项与B<--color=never>选项。\n","Use B<sdif> to show conflict marker format side by side with B<-V> option.\n":"使用B<sdif>与B<-V>选项并列显示冲突标记格式。\n","Set the whole text of the file as a target area.\n":"将文件的整个文本设置为目标区域。\n","With B<--xlate-fold> option, converted text is folded by the specified width. Default width is 70 and can be set by B<--xlate-fold-width> option. Four columns are reserved for run-in operation, so each line could hold 74 characters at most.\n":"使用B<--xlate-fold>选项，转换后的文本将按指定的宽度进行折叠。默认宽度为70，可以通过B<--xlate-fold-width>选项设置。四列是为磨合操作保留的，所以每行最多可以容纳74个字符。\n","Set your authentication key for DeepL service.\n":"为DeepL 服务设置你的认证密钥。\n","Command result goes to standard out, so redirect to file if necessary, or consider to use L<App::Greple::update> module.\n":"命令的结果会进入标准输出，所以如果需要的话，可以重定向到文件，或者考虑使用L<App::Greple::update>模块。\n","App::Greple::xlate - translation support module for greple\n":"App::Greple::xlate - greple的翻译支持模块\n","Print original and translated text separated by single blank line.\n":"打印原始文本和翻译文本，用单个空行分开。\n","Print original and translated text in L<cpp(1)> C<#ifdef> format.\n":"以 L<cpp(1)> C<#ifdef> 格式打印原始和翻译文本。\n","Specify the output format for original and translated text.\n":"指定原始和翻译文本的输出格式。\n","See the tranlsation result in real time in the STDERR output.\n":"在STDERR输出中可以看到实时的翻译结果。\n","Clear the cache data first.\n":"先清除缓存数据。\n","Then add C<--xlate> option to translate the selected area. It will find and replace them by the B<deepl> command output.\n":"然后添加C<--xlate>选项来翻译选定的区域。它将找到并替换为B<-deepl>命令的输出。\n","If you want to translate entire text, use B<--match-entire> option. This is a short-cut to specify the pattern matches entire text C<(?s).*>.\n":"如果你想翻译整个文本，使用B<--match-entire>选项。这是指定模式匹配整个文本的捷径，C<(?s).*>。\n"}