{
   "App::Greple::xlate - translation support module for greple\n" : "App::Greple::xlate - модуль поддержки перевода для greple\n",
   "B<Greple> B<xlate> module find text blocks and replace them by the translated text. Currently only DeepL service is supported by the B<xlate::deepl> module.\n" : "Модуль B<Greple> B<xlate> находит текстовые блоки и заменяет их переведенным текстом. В настоящее время модуль B<xlate::deepl> поддерживает только сервис DeepL.\n",
   "B<xlate> module can store cached text of translation for each file and read it before execution to eliminate the overhead of asking to server. With the default cache strategy C<auto>, it maintains cache data only when the cache file exists for target file.\n" : "Модуль B<xlate> может хранить кэшированный текст перевода для каждого файла и считывать его перед выполнением, чтобы исключить накладные расходы на запрос к серверу. При стратегии кэширования по умолчанию C<auto>, он сохраняет данные кэша только тогда, когда файл кэша существует для целевого файла.\n",
   "By default behavior, unused data is removed from the cache file. If you don't want to remove them and keep in the file, use C<accumulate>.\n" : "По умолчанию неиспользуемые данные удаляются из файла кэша. Если вы не хотите удалять их и сохранять в файле, используйте C<accumulate>.\n",
   "By default, original and translated text is printed in the \"conflict marker\" format compatible with L<git(1)>. Using C<ifdef> format, you can get desired part by L<unifdef(1)> command easily. Format can be specified by B<--xlate-format> option.\n" : "По умолчанию оригинальный и переведенный текст печатается в формате \"маркер конфликта\", совместимом с L<git(1)>. Используя формат C<ifdef>, вы можете легко получить нужную часть командой L<unifdef(1)>. Формат может быть задан опцией B<--xlate-format>.\n",
   "Clear the cache data first.\n" : "Сначала очистите данные кэша.\n",
   "Command result goes to standard out, so redirect to file if necessary, or consider to use L<App::Greple::update> module.\n" : "Результат команды выводится в стандартный аут, поэтому при необходимости перенаправьте его в файл или воспользуйтесь модулем L<App::Greple::update>.\n",
   "Create empty cache file and exit.\n" : "Создать пустой файл кэша и выйти.\n",
   "DeepL Python library and CLI command.\n" : "DeepL Библиотека Python и команда CLI.\n",
   "If the format is C<xtxt> (translated text) or unkown, only translated text is printed.\n" : "Если формат C<xtxt> (переведенный текст) или неизвестен, печатается только переведенный текст.\n",
   "If you want to translate entire text, use B<--match-all> option. This is a short-cut to specify the pattern matches entire text C<(?s).+>.\n" : "Если вы хотите перевести весь текст, используйте опцию B<--match-all>. Это сокращение для указания соответствия шаблона всему тексту C<(?s).+>.\n",
   "If you want to translate normal text block in L<pod> style document, use B<greple> command with C<xlate::deepl> and C<perl> module like this:\n" : "Если вы хотите перевести обычный текстовый блок в документе стиля L<pod>, используйте команду B<greple> с модулем C<xlate::deepl> и C<perl> следующим образом:\n",
   "Insted of calling translation engine, you are expected to work for. After preparing text to be translated, they are copied to the clipboard. You are expected to paste them to the form, copy the result to the clipboard, and hit return.\n" : "Вместо того чтобы вызывать систему перевода, вам предстоит работать. После подготовки текста для перевода он копируется в буфер обмена. Предполагается, что вы вставите их в форму, скопируете результат в буфер обмена и нажмете кнопку return.\n",
   "Invoke the translation process for each matched area.\n" : "Запустите процесс перевода для каждой совпавшей области.\n",
   "L<App::Greple::xlate>\n" : "L<App::Greple::xlate>\n",
   "Load the F<xlate.el> file included in the repository to use C<xlate> command from Emacs editor. C<xlate-region> function translate the given region. Default language is C<EN-US> and you can specify language invoking it with prefix argument.\n" : "Загрузите файл F<xlate.el>, включенный в репозиторий, чтобы использовать команду C<xlate> из редактора Emacs. Функция C<xlate-region> переводит заданный регион. Язык по умолчанию - C<EN-US>, и вы можете указать язык, вызывая ее с помощью аргумента prefix.\n",
   "Maintain cache anyway as far as the target is normal file.\n" : "Сохранять кэш в любом случае, пока целевой файл является обычным файлом.\n",
   "Maintain the cache file if it exists.\n" : "Сохранять файл кэша, если он существует.\n",
   "Never use cache file even if it exists.\n" : "Никогда не использовать файл кэша, даже если он существует.\n",
   "Option B<--xlate> calls B<--xlate-color> option with B<--color=never> option.\n" : "Опция B<--xlate> вызывает опцию B<--xlate-color> с опцией B<--color=never>.\n",
   "Pattern C<^(\\w.*\\n)+> means consecutive lines starting with alpha-numeric letter. This command show the area to be translated. Option B<--all> is used to produce entire text.\n" : "Шаблон C<^(\\w.*\\n)+> означает последовательные строки, начинающиеся с буквенно-цифровой буквы. Эта команда показывает область, которая должна быть переведена. Опция B<--all> используется для создания всего текста.\n",
   "Print original and translated text in L<cpp(1)> C<#ifdef> format.\n" : "Печать оригинального и переведенного текста в формате L<cpp(1)> C<#ifdef>.\n",
   "Print original and translated text in L<git(1)> conflict marker format.\n" : "Выведите оригинальный и переведенный текст в формате маркера конфликта L<git(1)>.\n",
   "Print original and translated text separated by single blank line.\n" : "Вывести оригинальный и переведенный текст, разделенные одной пустой строкой.\n",
   "See the B<greple> manual for the detail about target text pattern. Use B<--inside>, B<--outside>, B<--include>, B<--exclude> options to limit the matching area.\n" : "Подробную информацию о шаблоне целевого текста см. в руководстве B<greple>. Используйте опции B<--inside>, B<--outside>, B<--include>, B<--exclude> для ограничения области совпадения.\n",
   "See the tranlsation result in real time in the STDERR output.\n" : "Результат перевода можно увидеть в реальном времени в выводе STDERR.\n",
   "Set the whole text of the file as a target area.\n" : "Установите весь текст файла в качестве целевой области.\n",
   "Set your authentication key for DeepL service.\n" : "Задайте ключ аутентификации для сервиса DeepL.\n",
   "Specify the maximum length of text to be sent to the API at once. Default value is set as for free account service: 128K for the API (B<--xlate>) and 5000 for the clipboard interface (B<--xlate-labor>). You may be able to change these value if you are using Pro service.\n" : "Укажите максимальную длину текста, который будет отправлен в API за один раз. Значение по умолчанию установлено как для бесплатного сервиса: 128K для API (B<--xlate>) и 5000 для интерфейса буфера обмена (B<--xlate-labor>). Вы можете изменить эти значения, если используете услугу Pro.\n",
   "Specify the output format for original and translated text.\n" : "Укажите формат вывода оригинального и переведенного текста.\n",
   "Specify the target language. You can get available languages by C<deepl languages> command when using B<DeepL> engine.\n" : "Укажите целевой язык. Вы можете получить доступные языки с помощью команды C<deepl languages> при использовании движка B<DeepL>.\n",
   "Specify the translation engine to be used. You don't have to use this option because module C<xlate::deepl> declares it as C<--xlate-engine=deepl>.\n" : "Укажите используемый механизм перевода. Эту опцию можно не использовать, поскольку в модуле C<xlate::deepl> она объявлена как C<--xlate-engine=deepl>.\n",
   "The B<--cache-clear> option can be used to initiate cache management or to refresh all existing cache data. Once executed with this option, a new cache file will be created if one does not exist and then automatically maintained afterward.\n" : "Опция B<--cache-clear> может быть использована для инициирования управления кэшем или для обновления всех существующих данных кэша. После выполнения этой опции будет создан новый файл кэша, если он не существует, а затем автоматически сохранен.\n",
   "Then add C<--xlate> option to translate the selected area. It will find and replace them by the B<deepl> command output.\n" : "Затем добавьте опцию C<--xlate> для перевода выделенной области. Она найдет и заменит их на вывод команды B<deepl>.\n",
   "Use B<sdif> to show conflict marker format side by side with B<-V> option.\n" : "Используйте B<sdif>, чтобы показать формат маркера конфликта бок о бок с опцией B<-V>.\n",
   "With B<--xlate-fold> option, converted text is folded by the specified width. Default width is 70 and can be set by B<--xlate-fold-width> option. Four columns are reserved for run-in operation, so each line could hold 74 characters at most.\n" : "С опцией B<--xlate-fold> преобразованный текст сворачивается на указанную ширину. Ширина по умолчанию равна 70 и может быть задана опцией B<--xlate-fold-width>. Для обкатки зарезервировано четыре колонки, поэтому в каждой строке может содержаться не более 74 символов.\n",
   "Without this option, B<greple> behaves as a normal search command. So you can check which part of the file will be subject of the translation before invoking actual work.\n" : "Без этой опции B<greple> ведет себя как обычная команда поиска. Таким образом, вы можете проверить, какая часть файла будет подвергнута переводу, прежде чем вызывать фактическую работу.\n",
   "You can easily use this module from the command line by using the C<xlate> command included in the repository. See the C<xlate> help information for usage.\n" : "Вы можете легко использовать этот модуль из командной строки с помощью команды C<xlate>, включенной в репозиторий. Информацию об использовании смотрите в справке C<xlate>.\n",
   "You can recover the original file by next L<sed(1)> command.\n" : "Вы можете восстановить исходный файл следующей командой L<sed(1)>.\n",
   "You can retrieve only Japanese text by the B<unifdef> command:\n" : "Вы можете восстановить только японский текст командой B<unifdef>:\n",
   "You can use C<-Mupdate> module to modify files by the result of B<greple> command.\n" : "Вы можете использовать модуль C<-Mupdate> для модификации файлов по результатам команды B<greple>.\n"
}
