[
   [
      "App::Greple::xlate - translation support module for greple\n",
      "App::Greple::xlate - vertaalondersteuningsmodule voor greple\n"
   ],
   [
      "B<Greple> B<xlate> module find desired text blocks and replace them by the translated text. Currently DeepL (F<deepl.pm>) and ChatGPT 4.1 (F<gpt4.pm>) module are implemented as a back-end engine.\n",
      "B<Greple> B<xlate> module vindt de gewenste tekstblokken en vervangt ze door de vertaalde tekst. Momenteel zijn DeepL (F<deepl.pm>) en ChatGPT 4.1 (F<gpt4.pm>) module geïmplementeerd als back-end engine.\n"
   ],
   [
      "If you want to translate normal text blocks in a document written in the Perl's pod style, use B<greple> command with C<xlate::deepl> and C<perl> module like this:\n",
      "Als je normale tekstblokken wilt vertalen in een document dat geschreven is in de pod-stijl van Perl, gebruik dan het commando B<greple> met de module C<xlate::deepl> en C<perl> als volgt:\n"
   ],
   [
      "In this command, pattern string C<^([\\w\\pP].*\\n)+> means consecutive lines starting with alpha-numeric and punctuation letter. This command show the area to be translated highlighted. Option B<--all> is used to produce entire text.\n",
      "In deze opdracht betekent patroontekenreeks C<^([\\w\\pP].*\\n)+> opeenvolgende regels die beginnen met alfanumerieke letters en leestekens. Deze opdracht laat het te vertalen gebied gemarkeerd zien. Optie B<--all> wordt gebruikt om de volledige tekst te produceren.\n"
   ],
   [
      "Then add C<--xlate> option to translate the selected area. Then, it will find the desired sections and replace them by the B<deepl> command output.\n",
      "Voeg dan de optie C<--xlate> toe om het geselecteerde gebied te vertalen. Vervolgens worden de gewenste secties gevonden en vervangen door de uitvoer van de opdracht B<deepl>.\n"
   ],
   [
      "By default, original and translated text is printed in the \"conflict marker\" format compatible with L<git(1)>. Using C<ifdef> format, you can get desired part by L<unifdef(1)> command easily. Output format can be specified by B<--xlate-format> option.\n",
      "Standaard wordt originele en vertaalde tekst afgedrukt in het \"conflict marker\" formaat dat compatibel is met L<git(1)>. Door C<ifdef> formaat te gebruiken, kun je gemakkelijk het gewenste deel krijgen met L<unifdef(1)> commando. Uitvoerformaat kan gespecificeerd worden met B<--xlate-format> optie.\n"
   ],
   [
      "If you want to translate entire text, use B<--match-all> option. This is a short-cut to specify the pattern C<(?s).+> which matches entire text.\n",
      "Als je de hele tekst wilt vertalen, gebruik dan de optie B<--match-all>. Dit is een snelkoppeling om het patroon C<(?s).+> op te geven dat overeenkomt met de hele tekst.\n"
   ],
   [
      "Conflict marker format data can be viewed in side-by-side style by L<sdif|App::sdif> command with C<-V> option. Since it makes no sense to compare on a per-string basis, the C<--no-cdif> option is recommended. If you do not need to color the text, specify C<--no-textcolor> (or C<--no-tc>).\n",
      "Gegevens in conflictmarkerformaat kunnen naast elkaar worden bekeken met het L<sdif|App::sdif> commando met de C<-V> optie. Omdat het geen zin heeft om per string te vergelijken, wordt de optie C<--no-cdif> aanbevolen. Als je de tekst niet hoeft te kleuren, geef dan C<--no-textcolor> op (of C<--no-tc>).\n"
   ],
   [
      "Processing is done in specified units, but in the case of a sequence of multiple lines of non-empty text, they are converted together into a single line. This operation is performed as follows:\n",
      "De verwerking wordt gedaan in gespecificeerde eenheden, maar in het geval van een opeenvolging van meerdere regels niet-lege tekst, worden ze samen omgezet in een enkele regel. Deze bewerking wordt als volgt uitgevoerd:\n"
   ],
   [
      "Remove white space at the beginning and end of each line.\n",
      "Verwijder witruimte aan het begin en einde van elke regel.\n"
   ],
   [
      "If a line ends with a full-width punctuation character, concatenate with next line.\n",
      "Als een regel eindigt met een leesteken over de hele breedte, aaneenschakelen met de volgende regel.\n"
   ],
   [
      "If a line ends with a full-width character and the next line begins with a full-width character, concatenate the lines.\n",
      "Als een regel eindigt met een teken van volledige breedte en de volgende regel begint met een teken van volledige breedte, worden de regels aan elkaar gekoppeld.\n"
   ],
   [
      "If either the end or the beginning of a line is not a full-width character, concatenate them by inserting a space character.\n",
      "Als het einde of het begin van een regel geen teken voor de volledige breedte is, voeg ze dan samen door een spatieteken in te voegen.\n"
   ],
   [
      "Cache data is managed based on the normalized text, so even if modifications are made that do not affect the normalization results, the cached translation data will still be effective.\n",
      "Cachegegevens worden beheerd op basis van de genormaliseerde tekst, dus zelfs als er wijzigingen worden aangebracht die geen invloed hebben op de normalisatieresultaten, zullen de vertaalgegevens in de cache nog steeds effectief zijn.\n"
   ],
   [
      "This normalization process is performed only for the first (0th) and even-numbered pattern. Thus, if two patterns are specified as follows, the text matching the first pattern will be processed after normalization, and no normalization process will be performed on the text matching the second pattern.\n",
      "Dit normalisatieproces wordt alleen uitgevoerd voor het eerste (0e) en even genummerde patroon. Dus als twee patronen als volgt worden gespecificeerd, wordt de tekst die overeenkomt met het eerste patroon verwerkt na normalisatie en wordt er geen normalisatieproces uitgevoerd op de tekst die overeenkomt met het tweede patroon.\n"
   ],
   [
      "Therefore, use the first pattern for text that is to be processed by combining multiple lines into a single line, and use the second pattern for pre-formatted text. If there is no text to match in the first pattern, use a pattern that does not match anything, such as C<(?!)>.\n",
      "Gebruik daarom het eerste patroon voor tekst die verwerkt moet worden door meerdere regels samen te voegen tot een enkele regel, en gebruik het tweede patroon voor voorgeformatteerde tekst. Als er geen tekst is om mee te matchen in het eerste patroon, gebruik dan een patroon dat nergens mee overeenkomt, zoals C<(?!)>.\n"
   ],
   [
      "Occasionally, there are parts of text that you do not want translated. For example, tags in markdown files. DeepL suggests that in such cases, the part of the text to be excluded be converted to XML tags, translated, and then restored after the translation is complete. To support this, it is possible to specify the parts to be masked from translation.\n",
      "Soms zijn er delen van tekst die je niet vertaald wilt hebben. Bijvoorbeeld tags in markdown-bestanden. DeepL stelt voor dat in dergelijke gevallen het deel van de tekst dat moet worden uitgesloten, wordt geconverteerd naar XML-tags, wordt vertaald en vervolgens wordt hersteld nadat de vertaling is voltooid. Om dit te ondersteunen, is het mogelijk om de delen te specificeren die moeten worden gemaskeerd van vertaling.\n"
   ],
   [
      "This will interpret each line of the file `MASKPATTERN` as a regular expression, translate strings matching it, and revert after processing. Lines beginning with C<#> are ignored.\n",
      "Dit zal elke lijn van het bestand `MASKPATTERN` interpreteren als een reguliere expressie, strings vertalen die hiermee overeenstemmen en na verwerking terugzetten. Regels die beginnen met C<#> worden genegeerd.\n"
   ],
   [
      "Complex pattern can be written on multiple lines with backslash escpaed newline.\n",
      "Complexe patronen kunnen op meerdere regels worden geschreven met backslash escpaed newline.\n"
   ],
   [
      "How the text is transformed by masking can be seen by B<--xlate-mask> option.\n",
      "Hoe de tekst door het maskeren wordt omgezet, kun je zien met de optie B<--xlate-mask>.\n"
   ],
   [
      "This interface is experimental and subject to change in the future.\n",
      "Deze interface is experimenteel en kan in de toekomst veranderen.\n"
   ],
   [
      "Invoke the translation process for each matched area.\n",
      "Roep het vertaalproces op voor elk gematcht gebied.\n"
   ],
   [
      "Without this option, B<greple> behaves as a normal search command. So you can check which part of the file will be subject of the translation before invoking actual work.\n",
      "Zonder deze optie gedraagt B<greple> zich als een normaal zoekcommando. U kunt dus controleren welk deel van het bestand zal worden vertaald voordat u het eigenlijke werk uitvoert.\n"
   ],
   [
      "Command result goes to standard out, so redirect to file if necessary, or consider to use L<App::Greple::update> module.\n",
      "Commandoresultaat gaat naar standaard out, dus redirect naar bestand indien nodig, of overweeg L<App::Greple::update> module te gebruiken.\n"
   ],
   [
      "Option B<--xlate> calls B<--xlate-color> option with B<--color=never> option.\n",
      "Optie B<--xlate> roept B<--xlate-kleur> aan met B<--color=never> optie.\n"
   ],
   [
      "With B<--xlate-fold> option, converted text is folded by the specified width. Default width is 70 and can be set by B<--xlate-fold-width> option. Four columns are reserved for run-in operation, so each line could hold 74 characters at most.\n",
      "Met de optie B<--xlate-fold> wordt geconverteerde tekst gevouwen met de opgegeven breedte. De standaardbreedte is 70 en kan worden ingesteld met de optie B<--xlate-fold-width>. Vier kolommen zijn gereserveerd voor inloopoperaties, zodat elke regel maximaal 74 tekens kan bevatten.\n"
   ],
   [
      "Specifies the translation engine to be used. If you specify the engine module directly, such as C<-Mxlate::deepl>, you do not need to use this option.\n",
      "Specificeert de te gebruiken vertaalmachine. Als u de engine module rechtstreeks specificeert, zoals C<-Mxlate::deepl>, hoeft u deze optie niet te gebruiken.\n"
   ],
   [
      "At this time, the following engines are available\n",
      "Op dit moment zijn de volgende engines beschikbaar\n"
   ],
   [
      "B<gpt-4o>'s interface is unstable and cannot be guaranteed to work correctly at the moment.\n",
      "De interface van B<gpt-4o> is instabiel en er kan op dit moment niet gegarandeerd worden dat deze correct werkt.\n"
   ],
   [
      "Instead of calling translation engine, you are expected to work for. After preparing text to be translated, they are copied to the clipboard. You are expected to paste them to the form, copy the result to the clipboard, and hit return.\n",
      "In plaats van de vertaalmachine op te roepen, wordt er van je verwacht dat je zelf aan de slag gaat. Na het voorbereiden van tekst die vertaald moet worden, worden ze gekopieerd naar het klembord. Er wordt van je verwacht dat je ze op het formulier plakt, het resultaat naar het klembord kopieert en op return drukt.\n"
   ],
   [
      "Specify the target language. You can get available languages by C<deepl languages> command when using B<DeepL> engine.\n",
      "Geef de doeltaal op. U kunt de beschikbare talen krijgen met het commando C<deepl languages> wanneer u de engine B<DeepL> gebruikt.\n"
   ],
   [
      "Specify the output format for original and translated text.\n",
      "Specificeer het uitvoerformaat voor originele en vertaalde tekst.\n"
   ],
   [
      "The following formats other than C<xtxt> assume that the part to be translated is a collection of lines. In fact, it is possible to translate only a portion of a line, but specifying a format other than C<xtxt> will not produce meaningful results.\n",
      "De volgende indelingen anders dan C<xtxt> gaan ervan uit dat het te vertalen deel een verzameling regels is. In feite is het mogelijk om slechts een deel van een regel te vertalen, maar het specificeren van een andere opmaak dan C<xtxt> zal geen zinvolle resultaten opleveren.\n"
   ],
   [
      "Original and converted text are printed in L<git(1)> conflict marker format.\n",
      "Originele en geconverteerde tekst worden afgedrukt in L<git(1)> conflictmarkeerder formaat.\n"
   ],
   [
      "You can recover the original file by next L<sed(1)> command.\n",
      "U kunt het originele bestand herstellen met de volgende L<sed(1)> opdracht.\n"
   ],
   [
      "The original and translated text are output in a markdown's custom container style.\n",
      "De originele en vertaalde tekst worden uitgevoerd in de aangepaste containerstijl van markdown.\n"
   ],
   [
      "Above text will be translated to the following in HTML.\n",
      "Bovenstaande tekst wordt vertaald naar het volgende in HTML.\n"
   ],
   [
      "Number of colon is 7 by default. If you specify colon sequence like C<:::::>, it is used instead of 7 colons.\n",
      "Het aantal dubbele punten is standaard 7. Als je een dubbele punt reeks specificeert zoals C<:::::>, wordt deze gebruikt in plaats van 7 dubbele punten.\n"
   ],
   [
      "Original and converted text are printed in L<cpp(1)> C<#ifdef> format.\n",
      "Originele en geconverteerde tekst worden afgedrukt in L<cpp(1)> C<#ifdef> formaat.\n"
   ],
   [
      "You can retrieve only Japanese text by the B<unifdef> command:\n",
      "U kunt alleen Japanse tekst terughalen met het commando B<unifdef>:\n"
   ],
   [
      "Original and converted text are printed separated by single blank line. For C<space+>, it also outputs a newline after the converted text.\n",
      "Originele en geconverteerde tekst worden gescheiden afgedrukt door een enkele lege regel. Voor C<space+> wordt ook een nieuwe regel na de geconverteerde tekst afgedrukt.\n"
   ],
   [
      "If the format is C<xtxt> (translated text) or unkown, only translated text is printed.\n",
      "Als het formaat C<xtxt> (vertaalde tekst) of onbekend is, wordt alleen vertaalde tekst afgedrukt.\n"
   ],
   [
      "Specify the maximum length of text to be sent to the API at once. Default value is set as for free DeepL account service: 128K for the API (B<--xlate>) and 5000 for the clipboard interface (B<--xlate-labor>). You may be able to change these value if you are using Pro service.\n",
      "Geef de maximale lengte van de tekst op die in één keer naar de API moet worden gestuurd. De standaardwaarde is ingesteld zoals voor de gratis DeepL account service: 128K voor de API (B<--xlate>) en 5000 voor de klembordinterface (B<--xlate-labor>). U kunt deze waarden wijzigen als u Pro-service gebruikt.\n"
   ],
   [
      "Specify the maximum lines of text to be sent to the API at once.\n",
      "Geef het maximum aantal regels tekst op dat in één keer naar de API moet worden gestuurd.\n"
   ],
   [
      "Set this value to 1 if you want to translate one line at a time. This option takes precedence over the C<--xlate-maxlen> option.\n",
      "Stel deze waarde in op 1 als je één regel per keer wilt vertalen. Deze optie heeft voorrang op de C<--xlate-maxlen> optie.\n"
   ],
   [
      "Specify a custom prompt to be sent to the translation engine. This option is only available when using ChatGPT engines (gpt3, gpt4, gpt4o). You can customize the translation behavior by providing specific instructions to the AI model. If the prompt contains C<%s>, it will be replaced with the target language name.\n",
      "Geef een aangepaste prompt op die naar de vertaalmachine moet worden gestuurd. Deze optie is alleen beschikbaar bij gebruik van ChatGPT engines (gpt3, gpt4, gpt4o). Je kunt het vertaalgedrag aanpassen door specifieke instructies te geven aan het AI-model. Als de prompt C<%s> bevat, wordt deze vervangen door de naam van de doeltaal.\n"
   ],
   [
      "Specify additional context information to be sent to the translation engine. This option can be used multiple times to provide multiple context strings. The context information helps the translation engine understand the background and produce more accurate translations.\n",
      "Geef aanvullende contextinformatie op die naar de vertaalmachine moet worden gestuurd. Deze optie kan meerdere keren worden gebruikt om meerdere contextstrings op te geven. De contextinformatie helpt de vertaalmachine om de achtergrond te begrijpen en nauwkeurigere vertalingen te produceren.\n"
   ],
   [
      "Specify a glossary ID to be used for translation. This option is only available when using the DeepL engine. The glossary ID should be obtained from your DeepL account and ensures consistent translation of specific terms.\n",
      "Geef een woordenlijst-ID op die moet worden gebruikt voor vertaling. Deze optie is alleen beschikbaar wanneer je de DeepL engine gebruikt. De woordenlijst-ID moet verkregen worden via je DeepL account en zorgt voor een consistente vertaling van specifieke termen.\n"
   ],
   [
      "See the tranlsation result in real time in the STDERR output.\n",
      "Zie het resultaat van de vertaling in real time in de STDERR uitvoer.\n"
   ],
   [
      "Use L<App::Greple::stripe> module to show the matched part by zebra striping fashion. This is useful when the matched parts are connected back-to-back.\n",
      "Gebruik de module L<App::Greple::stripe> om het gematchte deel weer te geven met zebrastrepen. Dit is nuttig wanneer de gematchte delen rug-aan-rug verbonden zijn.\n"
   ],
   [
      "The color palette is switched according to the background color of the terminal. If you want to specify explicitly, you can use B<--xlate-stripe-light> or B<--xlate-stripe-dark>.\n",
      "Het kleurenpalet wordt omgeschakeld volgens de achtergrondkleur van de terminal. Als je dit expliciet wilt specificeren, kun je B<--xlate-stripe-light> of B<--xlate-stripe-dark> gebruiken.\n"
   ],
   [
      "Perform masking function and display the converted text as is without restoration.\n",
      "Voer de maskeerfunctie uit en geef de geconverteerde tekst weer zoals hij is, zonder restauratie.\n"
   ],
   [
      "Set the whole text of the file as a target area.\n",
      "Stel de hele tekst van het bestand in als doelgebied.\n"
   ],
   [
      "In the case of the C<cm> and C<colon> formats, the output is split and formatted line by line. Therefore, if only a portion of a line is to be translated, the expected result cannot be obtained. These filters fix output that is corrupted by translating part of a line into normal line-by-line output.\n",
      "In het geval van de C<cm> en C<colon> opmaak wordt de uitvoer regel voor regel opgesplitst en opgemaakt. Daarom kan het verwachte resultaat niet worden verkregen als slechts een deel van een regel moet worden vertaald. Deze filters herstellen uitvoer die beschadigd is door het vertalen van een deel van een regel naar normale regel-voor-regel uitvoer.\n"
   ],
   [
      "In the current implementation, if multiple parts of a line are translated, they are output as independent lines.\n",
      "In de huidige implementatie, als meerdere delen van een regel worden vertaald, worden ze uitgevoerd als onafhankelijke regels.\n"
   ],
   [
      "B<xlate> module can store cached text of translation for each file and read it before execution to eliminate the overhead of asking to server. With the default cache strategy C<auto>, it maintains cache data only when the cache file exists for target file.\n",
      "De module B<xlate> kan de tekst van de vertaling voor elk bestand in de cache opslaan en lezen vóór de uitvoering om de overhead van het vragen aan de server te elimineren. Met de standaard cache strategie C<auto>, onderhoudt het alleen cache gegevens wanneer het cache bestand bestaat voor het doelbestand.\n"
   ],
   [
      "Use B<--xlate-cache=clear> to initiate cache management or to clean up all existing cache data. Once executed with this option, a new cache file will be created if one does not exist and then automatically maintained afterward.\n",
      "Gebruik B<--xlate-cache=clear> om cachebeheer te starten of om alle bestaande cachegegevens op te ruimen. Eenmaal uitgevoerd met deze optie, zal een nieuw cachebestand worden aangemaakt als er geen bestaat en daarna automatisch worden onderhouden.\n"
   ],
   [
      "Maintain the cache file if it exists.\n",
      "Onderhoud het cachebestand als het bestaat.\n"
   ],
   [
      "Create empty cache file and exit.\n",
      "Maak een leeg cache bestand en sluit af.\n"
   ],
   [
      "Maintain cache anyway as far as the target is normal file.\n",
      "Cache-bestand toch behouden voor zover het doelbestand een normaal bestand is.\n"
   ],
   [
      "Clear the cache data first.\n",
      "Wis eerst de cachegegevens.\n"
   ],
   [
      "Never use cache file even if it exists.\n",
      "Cache-bestand nooit gebruiken, zelfs niet als het bestaat.\n"
   ],
   [
      "By default behavior, unused data is removed from the cache file. If you don't want to remove them and keep in the file, use C<accumulate>.\n",
      "Standaard worden ongebruikte gegevens uit het cachebestand verwijderd. Als u ze niet wilt verwijderen en in het bestand wilt houden, gebruik dan C<accumuleren>.\n"
   ],
   [
      "This option forces to update cache file even if it is not necessary.\n",
      "Deze optie dwingt om het cachebestand bij te werken, zelfs als dat niet nodig is.\n"
   ],
   [
      "You can easily use this module from the command line by using the C<xlate> command included in the distribution. See the C<xlate> man page for usage.\n",
      "Je kunt deze module eenvoudig vanaf de commandoregel gebruiken met het C<xlate> commando dat bij de distributie zit. Zie de C<xlate> man pagina voor het gebruik.\n"
   ],
   [
      "The C<xlate> command works in concert with the Docker environment, so even if you do not have anything installed on hand, you can use it as long as Docker is available. Use C<-D> or C<-C> option.\n",
      "Het C<xlate> commando werkt samen met de Docker omgeving, dus zelfs als je niets geïnstalleerd hebt, kun je het gebruiken zolang Docker beschikbaar is. Gebruik de optie C<-D> of C<-C>.\n"
   ],
   [
      "Also, since makefiles for various document styles are provided, translation into other languages is possible without special specification. Use C<-M> option.\n",
      "Omdat er makefiles voor verschillende documentstijlen worden meegeleverd, is vertaling naar andere talen mogelijk zonder speciale specificaties. Gebruik de optie C<-M>.\n"
   ],
   [
      "You can also combine the Docker and C<make> options so that you can run C<make> in a Docker environment.\n",
      "Je kunt ook de Docker en C<make> opties combineren, zodat je C<make> in een Docker omgeving kunt draaien.\n"
   ],
   [
      "Running like C<xlate -C> will launch a shell with the current working git repository mounted.\n",
      "Uitvoeren als C<xlate -C> zal een shell starten met de huidige werkende git repository aangekoppeld.\n"
   ],
   [
      "Read Japanese article in L</SEE ALSO> section for detail.\n",
      "Lees het Japanse artikel in de L</SEE ALSO> sectie voor meer informatie.\n"
   ],
   [
      "Load the F<xlate.el> file included in the repository to use C<xlate> command from Emacs editor. C<xlate-region> function translate the given region. Default language is C<EN-US> and you can specify language invoking it with prefix argument.\n",
      "Laad het F<xlate.el> bestand in het archief om het C<xlate> commando te gebruiken vanuit de Emacs editor. C<xlate-region> functie vertaalt de gegeven regio. De standaardtaal is C<EN-US> en u kunt de taal specificeren met het prefix argument.\n"
   ],
   [
      "Set your authentication key for DeepL service.\n",
      "Stel uw authenticatiesleutel in voor DeepL service.\n"
   ],
   [
      "OpenAI authentication key.\n",
      "OpenAI authenticatiesleutel.\n"
   ],
   [
      "You have to install command line tools for DeepL and ChatGPT.\n",
      "Je moet commandoregeltools installeren voor DeepL en ChatGPT.\n"
   ],
   [
      "L<https://github.com/DeepLcom/deepl-python>\n",
      "L<https://github.com/DeepLcom/deepl-python>\n"
   ],
   [
      "L<https://github.com/tecolicom/App-gpty>\n",
      "L<https://github.com/tecolicom/App-gpty>\n"
   ],
   [
      "L<App::Greple::xlate>\n",
      "L<App::Greple::xlate>\n"
   ],
   [
      "L<App::Greple::xlate::deepl>\n",
      "L<App::Greple::xlate::deepl>\n"
   ],
   [
      "L<App::Greple::xlate::gpt4>\n",
      "L<App::Greple::xlate::gpt4>\n"
   ],
   [
      "Docker container image.\n",
      "Docker containerafbeelding.\n"
   ],
   [
      "DeepL Python library and CLI command.\n",
      "DeepL Python bibliotheek en CLI commando.\n"
   ],
   [
      "OpenAI Python Library\n",
      "OpenAI Python Bibliotheek\n"
   ],
   [
      "OpenAI command line interface\n",
      "OpenAI opdrachtregelinterface\n"
   ],
   [
      "See the B<greple> manual for the detail about target text pattern. Use B<--inside>, B<--outside>, B<--include>, B<--exclude> options to limit the matching area.\n",
      "Zie de B<greple> handleiding voor de details over het doeltekstpatroon. Gebruik B<--inside>, B<--outside>, B<--include>, B<--exclude> opties om het overeenkomende gebied te beperken.\n"
   ],
   [
      "You can use C<-Mupdate> module to modify files by the result of B<greple> command.\n",
      "U kunt de module C<-Mupdate> gebruiken om bestanden te wijzigen door het resultaat van het commando B<greple>.\n"
   ],
   [
      "Use B<sdif> to show conflict marker format side by side with B<-V> option.\n",
      "Gebruik B<sdif> om het formaat van de conflictmarkering naast de optie B<-V> te tonen.\n"
   ],
   [
      "Greple B<stripe> module use by B<--xlate-stripe> option.\n",
      "Greple B<stripe> module gebruik door B<--xlate-stripe> optie.\n"
   ],
   [
      "Greple module to translate and replace only the necessary parts with DeepL API (in Japanese)\n",
      "Greple module om alleen de benodigde onderdelen te vertalen en te vervangen met DeepL API (in het Japans)\n"
   ],
   [
      "Generating documents in 15 languages with DeepL API module (in Japanese)\n",
      "Documenten genereren in 15 talen met DeepL API-module (in het Japans)\n"
   ],
   [
      "Automatic translation Docker environment with DeepL API (in Japanese)\n",
      "Automatisch vertaalde Docker-omgeving met DeepL API (in het Japans)\n"
   ]
]
