{"By default, original and translated text is printed in the \"conflict marker\" format compatible with L<git(1)>. Using C<ifdef> format, you can get desired part by L<unifdef(1)> command easily. Format can be specified by B<--xlate-format> option.\n":"Standaard worden originele en vertaalde tekst afgedrukt in het \"conflict marker\" formaat dat compatibel is met L<git(1)>. Door C<ifdef> formaat te gebruiken, kunt u gemakkelijk het gewenste deel krijgen met het L<unifdef(1)> commando. Het formaat kan gespecificeerd worden met de optie B<--xlate-format>.\n","If you want to translate normal text block in L<pod> style document, use B<greple> command with C<xlate::deepl> and C<perl> module like this:\n":"Als je normale tekstblokken in L<pod> style document wilt vertalen, gebruik dan B<greple> commando met C<xlate::deepl> en C<perl> module zoals dit:\n","Set your authentication key for DeepL service.\n":"Stel uw authenticatiesleutel in voor DeepL service.\n","Clear the cache data first.\n":"Wis eerst de cachegegevens.\n","L<App::Greple::xlate>\n":"L<App::Greple::xlate>\n","Specify the output format for original and translated text.\n":"Specificeer het uitvoerformaat voor originele en vertaalde tekst.\n","Print original and translated text separated by single blank line.\n":"Originele en vertaalde tekst afdrukken, gescheiden door een enkele lege regel.\n","Never use cache file even if it exists.\n":"Cache-bestand nooit gebruiken, zelfs niet als het bestaat.\n","Insted of calling translation engine, you are expected to work for. After preparing text to be translated, they are copied to the clipboard. You are expected to paste them to the form, copy the result to the clipboard, and hit return.\n":"In plaats van de vertaalmachine op te roepen, wordt van u verwacht dat u voor werkt. Na het voorbereiden van te vertalen tekst, worden ze gekopieerd naar het klembord. Van u wordt verwacht dat u ze in het formulier plakt, het resultaat naar het klembord kopieert en op return drukt.\n","Invoke the translation process for each matched area.\n":"Roep het vertaalproces op voor elk gematcht gebied.\n","You can easily use this module from the command line by using the C<xlate> command included in the repository. See the C<xlate> help information for usage.\n":"U kunt deze module gemakkelijk gebruiken vanaf de commandoregel met het commando C<xlate> dat in het archief is opgenomen. Zie de C<xlate> help informatie voor gebruik.\n","Load the F<xlate.el> file included in the repository to use C<xlate> command from Emacs editor. C<xlate-region> function translate the given region. Default language is C<EN-US> and you can specify language invoking it with prefix argument.\n":"Laad het F<xlate.el> bestand in het archief om het C<xlate> commando te gebruiken vanuit de Emacs editor. C<xlate-region> functie vertaalt de gegeven regio. De standaardtaal is C<EN-US> en u kunt de taal specificeren met het prefix argument.\n","Specify the target language. You can get available languages by C<deepl languages> command when using B<DeepL> engine.\n":"Geef de doeltaal op. U kunt de beschikbare talen krijgen met het commando C<deepl languages> wanneer u de engine B<DeepL> gebruikt.\n","You can retrieve only Japanese text by the B<unifdef> command:\n":"U kunt alleen Japanse tekst terughalen met het commando B<unifdef>:\n","Print original and translated text in L<git(1)> conflict marker format.\n":"Print originele en vertaalde tekst in L<git(1)> conflictmarker formaat.\n","Print original and translated text in L<cpp(1)> C<#ifdef> format.\n":"Originele en vertaalde tekst afdrukken in L<cpp(1)> C<#ifdef> formaat.\n","If the format is C<xtxt> (translated text) or unkown, only translated text is printed.\n":"Als het formaat C<xtxt> (vertaalde tekst) of onbekend is, wordt alleen vertaalde tekst afgedrukt.\n","B<xlate> module can store cached text of translation for each file and read it before execution to eliminate the overhead of asking to server. With the default cache strategy C<auto>, it maintains cache data only when the cache file exists for target file.\n":"De module B<xlate> kan de tekst van de vertaling voor elk bestand in de cache opslaan en lezen vóór de uitvoering om de overhead van het vragen aan de server te elimineren. Met de standaard cache strategie C<auto>, onderhoudt het alleen cache gegevens wanneer het cache bestand bestaat voor het doelbestand.\n","Specify the maximum length of text to be sent to the API at once. Default value is set as for free account service: 128K for the API (B<--xlate>) and 5000 for the clipboard interface (B<--xlate-labor>). You may be able to change these value if you are using Pro service.\n":"Specificeer de maximale lengte van de tekst die in één keer naar de API moet worden gestuurd. De standaardwaarde is ingesteld zoals voor de gratis accountdienst: 128K voor de API (B<--xlate>) en 5000 voor de klembordinterface (B<--xlate-labor>). U kunt deze waarde wijzigen als u de Pro-service gebruikt.\n","Set the whole text of the file as a target area.\n":"Stel de hele tekst van het bestand in als doelgebied.\n","DeepL Python library and CLI command.\n":"DeepL Python bibliotheek en CLI commando.\n","Command result goes to standard out, so redirect to file if necessary, or consider to use L<App::Greple::update> module.\n":"Commandoresultaat gaat naar standaard out, dus redirect naar bestand indien nodig, of overweeg L<App::Greple::update> module te gebruiken.\n","Create empty cache file and exit.\n":"Maak een leeg cache bestand en sluit af.\n","Without this option, B<greple> behaves as a normal search command. So you can check which part of the file will be subject of the translation before invoking actual work.\n":"Zonder deze optie gedraagt B<greple> zich als een normaal zoekcommando. U kunt dus controleren welk deel van het bestand zal worden vertaald voordat u het eigenlijke werk uitvoert.\n","App::Greple::xlate - translation support module for greple\n":"App::Greple::xlate - vertaalondersteuningsmodule voor greple\n","By default behavior, unused data is removed from the cache file. If you don't want to remove them and keep in the file, use C<accumulate>.\n":"Standaard worden ongebruikte gegevens uit het cachebestand verwijderd. Als u ze niet wilt verwijderen en in het bestand wilt houden, gebruik dan C<accumuleren>.\n","Option B<--xlate> calls B<--xlate-color> option with B<--color=never> option.\n":"Optie B<--xlate> roept B<--xlate-kleur> aan met B<--color=never> optie.\n","See the tranlsation result in real time in the STDERR output.\n":"Zie het resultaat van de vertaling in real time in de STDERR uitvoer.\n","Maintain cache anyway as far as the target is normal file.\n":"Cache-bestand toch behouden voor zover het doelbestand een normaal bestand is.\n","You can recover the original file by next L<sed(1)> command.\n":"U kunt het originele bestand herstellen met de volgende L<sed(1)> opdracht.\n","Use B<sdif> to show conflict marker format side by side with B<-V> option.\n":"Gebruik B<sdif> om het formaat van de conflictmarkering naast de optie B<-V> te tonen.\n","B<Greple> B<xlate> module find text blocks and replace them by the translated text. Currently only DeepL service is supported by the B<xlate::deepl> module.\n":"B<Greple> B<xlate> module vindt tekstblokken en vervangt ze door de vertaalde tekst. Momenteel wordt alleen DeepL service ondersteund door de B<xlate::deepl> module.\n","Maintain the cache file if it exists.\n":"Onderhoud het cachebestand als het bestaat.\n","Specify the translation engine to be used. You don't have to use this option because module C<xlate::deepl> declares it as C<--xlate-engine=deepl>.\n":"Specificeer de te gebruiken vertaalmachine. U hoeft deze optie niet te gebruiken omdat module C<xlate::deepl> deze verklaart als C<--xlate-engine=deepl>.\n","You can use C<-Mupdate> module to modify files by the result of B<greple> command.\n":"U kunt de module C<-Mupdate> gebruiken om bestanden te wijzigen door het resultaat van het commando B<greple>.\n","With B<--xlate-fold> option, converted text is folded by the specified width. Default width is 70 and can be set by B<--xlate-fold-width> option. Four columns are reserved for run-in operation, so each line could hold 74 characters at most.\n":"Met de optie B<--xlate-fold> wordt geconverteerde tekst gevouwen met de opgegeven breedte. De standaardbreedte is 70 en kan worden ingesteld met de optie B<--xlate-fold-width>. Vier kolommen zijn gereserveerd voor inloopoperaties, zodat elke regel maximaal 74 tekens kan bevatten.\n","Then add C<--xlate> option to translate the selected area. It will find and replace them by the B<deepl> command output.\n":"Voeg dan de optie C<--xlate> toe om het geselecteerde gebied te vertalen. Het zal ze vinden en vervangen door de uitvoer van het B<deepl> commando.\n","The B<--cache-clear> option can be used to initiate cache management or to refresh all existing cache data. Once executed with this option, a new cache file will be created if one does not exist and then automatically maintained afterward.\n":"De optie B<--cache-clear> kan worden gebruikt om het beheer van de cache te starten of om alle bestaande cache-gegevens te vernieuwen. Eenmaal uitgevoerd met deze optie, wordt een nieuw cachebestand aangemaakt als er geen bestaat en daarna automatisch onderhouden.\n","If you want to translate entire text, use B<--match-all> option. This is a short-cut to specify the pattern matches entire text C<(?s).+>.\n":"Als u de hele tekst wilt vertalen, gebruik dan de optie B<--match-all>. Dit is een snelkoppeling om aan te geven dat het patroon overeenkomt met de hele tekst C<(?s).+>.\n","See the B<greple> manual for the detail about target text pattern. Use B<--inside>, B<--outside>, B<--include>, B<--exclude> options to limit the matching area.\n":"Zie de B<greple> handleiding voor de details over het doeltekstpatroon. Gebruik B<--inside>, B<--outside>, B<--include>, B<--exclude> opties om het overeenkomende gebied te beperken.\n","Pattern C<^(\\w.*\\n)+> means consecutive lines starting with alpha-numeric letter. This command show the area to be translated. Option B<--all> is used to produce entire text.\n":"Patroon C<^(\\w.*\\n)+> betekent opeenvolgende regels die beginnen met een alfa-numerieke letter. Dit commando toont het te vertalen gebied. Optie B<--all> wordt gebruikt om de hele tekst te produceren.\n"}