{
   "App::Greple::xlate - translation support module for greple\n" : "App::Greple::xlate - greple 用の翻訳サポートモジュール\n",
   "Automatic translation Docker environment with DeepL API (in Japanese)\n" : "DeepL APIによる自動翻訳Docker環境\n",
   "B<Greple> B<xlate> module find desired text blocks and replace them by the translated text. Currently DeepL (F<deepl.pm>) and ChatGPT (F<gpt3.pm>) module are implemented as a back-end engine.\n" : "B<Greple> B<xlate>モジュールは目的のテキストブロックを見つけ、翻訳されたテキストに置き換えます。現在、DeepL (F<deepl.pm>) と ChatGPT (F<gpt3.pm>) モジュールがバックエンドエンジンとして実装されています。\n",
   "B<xlate> module can store cached text of translation for each file and read it before execution to eliminate the overhead of asking to server. With the default cache strategy C<auto>, it maintains cache data only when the cache file exists for target file.\n" : "B<xlate>モジュールは、各ファイルの翻訳テキストをキャッシュしておき、実行前にそれを読むことで、サーバーへの問い合わせのオーバーヘッドをなくすことができます。デフォルトのキャッシュ戦略C<auto>では、対象ファイルに対してキャッシュファイルが存在する場合のみ、キャッシュデータを保持する。\n",
   "By default behavior, unused data is removed from the cache file. If you don't want to remove them and keep in the file, use C<accumulate>.\n" : "デフォルトの動作では、未使用のデータはキャッシュファイルから削除されます。削除せずに残しておきたい場合は、C<蓄積>を使用してください。\n",
   "By default, original and translated text is printed in the \"conflict marker\" format compatible with L<git(1)>. Using C<ifdef> format, you can get desired part by L<unifdef(1)> command easily. Output format can be specified by B<--xlate-format> option.\n" : "デフォルトでは、原文と翻訳文は L<git(1)> と互換性のある \"conflict marker\" フォーマットで出力されます。C<ifdef>形式を使えば、L<unifdef(1)>コマンドで簡単に目的の部分を取得できます。出力形式はB<--xlate-format>オプションで指定できます。\n",
   "Clear the cache data first.\n" : "キャッシュデータを先にクリアする。\n",
   "Command result goes to standard out, so redirect to file if necessary, or consider to use L<App::Greple::update> module.\n" : "コマンドの結果は標準出力されますので、必要に応じてファイルにリダイレクトするか、L<App::Greple::update>モジュールの使用を検討してください。\n",
   "Create empty cache file and exit.\n" : "空のキャッシュファイルを作成し、終了する。\n",
   "DeepL Python library and CLI command.\n" : "DeepL の Python ライブラリと CLI コマンド。\n",
   "Generating documents in 15 languages with DeepL API module (in Japanese)\n" : "DeepL APIモジュールによる15言語のドキュメント生成\n",
   "Greple module to translate and replace only the necessary parts with DeepL API (in Japanese)\n" : "DeepL APIで必要な部分だけを翻訳して置き換えるGrepleモジュール\n",
   "If the format is C<xtxt> (translated text) or unkown, only translated text is printed.\n" : "フォーマットがC<xtxt>（翻訳文）またはunknownの場合、翻訳文のみが印刷されます。\n",
   "If you want to translate entire text, use B<--match-all> option. This is a short-cut to specify the pattern C<(?s).+> which matches entire text.\n" : "テキスト全体を翻訳したい場合は、B<--match-all>オプションを使います。これはテキスト全体にマッチするパターンC<(?s).+>を指定するショートカットです。\n",
   "If you want to translate normal text blocks in a document written in the Perl's pod style, use B<greple> command with C<xlate::deepl> and C<perl> module like this:\n" : "Perlのポッドスタイルで書かれた文書中の通常のテキストブロックを翻訳したい場合は、B<greple>コマンドをC<xlate::deepl>とC<perl>モジュールと一緒に次のように使います：\n",
   "In this command, pattern string C<^(\\w.*\\n)+> means consecutive lines starting with alpha-numeric letter. This command show the area to be translated highlighted. Option B<--all> is used to produce entire text.\n" : "このコマンドでは、パターン文字列C<^( \\w.*n)+> は英数字で始まる連続行を意味する。このコマンドでは、翻訳される領域が強調表示される。オプションB<--all>はテキスト全体を表示する。\n",
   "Instead of calling translation engine, you are expected to work for. After preparing text to be translated, they are copied to the clipboard. You are expected to paste them to the form, copy the result to the clipboard, and hit return.\n" : "翻訳エンジンを呼び出す代わりに、翻訳エンジンのために働くことが期待されています。翻訳するテキストを準備すると、クリップボードにコピーされます。それをフォームに貼り付け、結果をクリップボードにコピーし、リターンキーを押す。\n",
   "Invoke the translation process for each matched area.\n" : "マッチした領域ごとに翻訳処理を起動します。\n",
   "L<App::Greple::xlate::deepl>\n" : "L<App::Greple::xlate::deepl>をインストールします。\n",
   "L<App::Greple::xlate::gpt3>\n" : "L<App::Greple::xlate::gpt3> をインストールしてください。\n",
   "L<App::Greple::xlate>\n" : "L<App::Greple::xlate>を使用します。\n",
   "L<https://github.com/DeepLcom/deepl-python>\n" : "L<https://github.com/DeepLcom/deepl-python>\n",
   "L<https://github.com/tecolicom/App-gpty>\n" : "L<https://github.com/tecolicom/App-gpty>\n",
   "L<https://hub.docker.com/r/tecolicom/xlate>\n" : "L<https://hub.docker.com/r/tecolicom/xlate>\n",
   "Load the F<xlate.el> file included in the repository to use C<xlate> command from Emacs editor. C<xlate-region> function translate the given region. Default language is C<EN-US> and you can specify language invoking it with prefix argument.\n" : "EmacsエディタからC<xlate>コマンドを使うには、リポジトリに含まれているF<xlate.el>ファイルを読み込んでください。C<xlate-region>関数は、指定された地域を翻訳する。デフォルトの言語はC<EN-US>で、prefix引数で言語を指定することができます。\n",
   "Maintain cache anyway as far as the target is normal file.\n" : "対象が通常ファイルである限り、とにかくキャッシュを維持する。\n",
   "Maintain the cache file if it exists.\n" : "キャッシュファイルが存在する場合は、それを維持する。\n",
   "Never use cache file even if it exists.\n" : "キャッシュファイルが存在しても決して使用しない。\n",
   "OpenAI Python Library\n" : "OpenAI Python ライブラリ\n",
   "OpenAI authentication key.\n" : "OpenAI認証キー。\n",
   "OpenAI command line interface\n" : "OpenAIコマンドラインインターフェイス\n",
   "Option B<--xlate> calls B<--xlate-color> option with B<--color=never> option.\n" : "B<--xlate>オプションは、B<--xlate-color>オプションをB<--color=never>オプションで呼び出します。\n",
   "Original and converted text are printed in L<cpp(1)> C<#ifdef> format.\n" : "オリジナルと変換後のテキストは、L<cpp(1)> C<#ifdef> フォーマットで表示されます。\n",
   "Original and converted text are printed in L<git(1)> conflict marker format.\n" : "オリジナルと変換後のテキストは、L<git(1)> conflict marker フォーマットで表示されます。\n",
   "Original and converted text are printed separated by single blank line.\n" : "元のテキストと変換後のテキストは、1行の空白行で区切られて表示されます。\n",
   "See the B<greple> manual for the detail about target text pattern. Use B<--inside>, B<--outside>, B<--include>, B<--exclude> options to limit the matching area.\n" : "対象テキストパターンの詳細については、B<greple>のマニュアルを参照してください。B<--inside>, B<--outside>, B<--include>, B<--exclude>オプションでマッチング範囲を限定することができます。\n",
   "See the tranlsation result in real time in the STDERR output.\n" : "翻訳結果はSTDERR出力にリアルタイムで表示されます。\n",
   "Set the whole text of the file as a target area.\n" : "ファイルの全テキストを対象範囲に設定する。\n",
   "Set your authentication key for DeepL service.\n" : "DeepLサービス用の認証キーを設定します。\n",
   "Specifies the translation engine to be used. If you specify the engine module directly, such as C<-Mxlate::deepl>, you do not need to use this option.\n" : "使用する翻訳エンジンを指定します。C<-Mxlate::deepl>のようにエンジンモジュールを直接指定する場合は、このオプションを使用する必要はありません。\n",
   "Specify the maximum length of text to be sent to the API at once. Default value is set as for free DeepL account service: 128K for the API (B<--xlate>) and 5000 for the clipboard interface (B<--xlate-labor>). You may be able to change these value if you are using Pro service.\n" : "APIに一度に送信するテキストの最大長を指定します。既定値は、無料の DeepL アカウント・サービスと同じように、API (B<--xlate>) では 128K、クリップボード・インタフェース (B<--xlate-labor>) では 5000 に設定されています。Pro サービスを使用している場合は、これらの値を変更できます。\n",
   "Specify the output format for original and translated text.\n" : "原文と訳文の出力形式を指定する。\n",
   "Specify the target language. You can get available languages by C<deepl languages> command when using B<DeepL> engine.\n" : "対象言語を指定します。B<DeepL>エンジンを使っている場合は、C<deepl languages>コマンドで利用可能な言語を得ることができます。\n",
   "The B<--cache-clear> option can be used to initiate cache management or to refresh all existing cache data. Once executed with this option, a new cache file will be created if one does not exist and then automatically maintained afterward.\n" : "B<--cache-clear>オプションは、キャッシュ管理を開始するか、既存のキャッシュデータをすべてリフレッシュするために使用される。このオプションを一度実行すると、キャッシュファイルが存在しない場合は新規に作成され、その後は自動的にメンテナンスされる。\n",
   "Then add C<--xlate> option to translate the selected area. Then, it will find the desired sections and replace them by the B<deepl> command output.\n" : "次に、C<--xlate>オプションを追加して、選択した領域を翻訳する。そして、必要な部分を見つけ、B<deepl>コマンドの出力で置き換える。\n",
   "Use B<sdif> to show conflict marker format side by side with B<-V> option.\n" : "B<sdif>を使用すると、B<-V>オプションでコンフリクトマーカー形式を並べて表示することができます。\n",
   "With B<--xlate-fold> option, converted text is folded by the specified width. Default width is 70 and can be set by B<--xlate-fold-width> option. Four columns are reserved for run-in operation, so each line could hold 74 characters at most.\n" : "B<--xlate-fold>オプションでは、変換されたテキストを指定した幅で折り返す。デフォルトの幅は70で、B<--xlate-fold-width>オプションで設定することができる。ランイン動作のために4列が確保されているので、1行には最大で74文字が格納できる。\n",
   "Without this option, B<greple> behaves as a normal search command. So you can check which part of the file will be subject of the translation before invoking actual work.\n" : "このオプションがない場合、B<greple>は通常の検索コマンドとして動作します。したがって、ファイルのどの部分が翻訳の対象となるかを、実際の作業を始める前に確認することができます。\n",
   "You can easily use this module from the command line by using the C<xlate> command included in the repository. See the C<xlate> help information for usage.\n" : "リポジトリに含まれるC<xlate>コマンドを使用することで、コマンドラインから本モジュールを簡単に使用することができます。使い方については、C<xlate>のヘルプ情報を参照してください。\n",
   "You can recover the original file by next L<sed(1)> command.\n" : "次のL<sed(1)>コマンドで元のファイルを復元することができます。\n",
   "You can retrieve only Japanese text by the B<unifdef> command:\n" : "B<unifdef>コマンドで日本語テキストのみを取り出すことができます。\n",
   "You can use C<-Mupdate> module to modify files by the result of B<greple> command.\n" : "C<-Mupdate>モジュールを用いると、B<greple>コマンドの結果をもとにファイルを修正することができます。\n",
   "You have to install command line tools for DeepL and ChatGPT.\n" : "DeepLおよびChatGPT用のコマンドラインツールをインストールする必要があります。\n"
}
