{
   "App::Greple::xlate - translation support module for greple\n" : "App::Greple::xlate - module d'aide à la traduction pour greple\n",
   "B<Greple> B<xlate> module find text blocks and replace them by the translated text. Currently DeepL (F<deepl.pm>) and ChatGPT (F<gpt3.pm>) module are implemeted as a back-end engine.\n" : "Le module B<Greple> B<xlate> recherche les blocs de texte et les remplace par le texte traduit. Actuellement, les modules DeepL (F<deepl.pm>) et ChatGPT (F<gpt3.pm>) sont implémentés en tant que moteur dorsal.\n",
   "B<xlate> module can store cached text of translation for each file and read it before execution to eliminate the overhead of asking to server. With the default cache strategy C<auto>, it maintains cache data only when the cache file exists for target file.\n" : "Le module B<xlate> peut stocker le texte de la traduction en cache pour chaque fichier et le lire avant l'exécution pour éliminer les frais généraux de demande au serveur. Avec la stratégie de cache par défaut C<auto>, il maintient les données de cache uniquement lorsque le fichier de cache existe pour le fichier cible.\n",
   "By default behavior, unused data is removed from the cache file. If you don't want to remove them and keep in the file, use C<accumulate>.\n" : "Par défaut, les données inutilisées sont supprimées du fichier cache. Si vous ne voulez pas les supprimer et les conserver dans le fichier, utilisez C<accumulate>.\n",
   "By default, original and translated text is printed in the \"conflict marker\" format compatible with L<git(1)>. Using C<ifdef> format, you can get desired part by L<unifdef(1)> command easily. Output format can be specified by B<--xlate-format> option.\n" : "Par défaut, les textes originaux et traduits sont imprimés dans le format \"marqueur de conflit\" compatible avec L<git(1)>. En utilisant le format C<ifdef>, vous pouvez facilement obtenir la partie souhaitée par la commande L<unifdef(1)>. Le format de sortie peut être spécifié par l'option B<--xlate-format>.\n",
   "Clear the cache data first.\n" : "Effacer d'abord les données du cache.\n",
   "Command result goes to standard out, so redirect to file if necessary, or consider to use L<App::Greple::update> module.\n" : "Le résultat de la commande va vers la sortie standard, donc redirigez vers le fichier si nécessaire, ou envisagez d'utiliser le module L<App::Greple::update>.\n",
   "Create empty cache file and exit.\n" : "Créer un fichier cache vide et quitter.\n",
   "DeepL Python library and CLI command.\n" : "DeepL Bibliothèque Python et commande CLI.\n",
   "If the format is C<xtxt> (translated text) or unkown, only translated text is printed.\n" : "Si le format est C<xtxt> (texte traduit) ou inconnu, seul le texte traduit est imprimé.\n",
   "If you want to translate entire text, use B<--match-all> option. This is a short-cut to specify the pattern C<(?s).+> which matches entire text.\n" : "Si vous souhaitez traduire un texte entier, utilisez l'option B<--match-all>. Il s'agit d'un raccourci pour spécifier le modèle C<(?s).+> qui correspond à un texte entier.\n",
   "If you want to translate normal text blocks written in the L<pod> style, use B<greple> command with C<xlate::deepl> and C<perl> module like this:\n" : "Si vous souhaitez traduire des blocs de texte normaux écrits dans le style L<pod>, utilisez la commande B<greple> avec les modules C<xlate::deepl> et C<perl> comme ceci :\n",
   "Insted of calling translation engine, you are expected to work for. After preparing text to be translated, they are copied to the clipboard. You are expected to paste them to the form, copy the result to the clipboard, and hit return.\n" : "Au lieu d'appeler le moteur de traduction, vous êtes censé travailler pour. Après avoir préparé les textes à traduire, ils sont copiés dans le presse-papiers. Vous êtes censé les coller dans le formulaire, copier le résultat dans le presse-papiers et appuyer sur la touche retour.\n",
   "Invoke the translation process for each matched area.\n" : "Invoquez le processus de traduction pour chaque zone appariée.\n",
   "L<App::Greple::xlate::deepl>\n" : "L<App::Greple::xlate::deepl>\n",
   "L<App::Greple::xlate::gpt3>\n" : "L<App::Greple::xlate::gpt3>\n",
   "L<App::Greple::xlate>\n" : "L<App::Greple::xlate>\n",
   "L<https://github.com/DeepLcom/deepl-python>\n" : "L<https://github.com/DeepLcom/deepl-python>\n",
   "L<https://github.com/tecolicom/App-gpty>\n" : "L<https://github.com/tecolicom/App-gpty>\n",
   "Load the F<xlate.el> file included in the repository to use C<xlate> command from Emacs editor. C<xlate-region> function translate the given region. Default language is C<EN-US> and you can specify language invoking it with prefix argument.\n" : "Chargez le fichier F<xlate.el> inclus dans le dépôt pour utiliser la commande C<xlate> à partir de l'éditeur Emacs. La fonction C<xlate-region> traduit la région donnée. La langue par défaut est C<EN-US> et vous pouvez spécifier la langue en l'invoquant avec l'argument prefix.\n",
   "Maintain cache anyway as far as the target is normal file.\n" : "Maintenir le cache de toute façon tant que la cible est un fichier normal.\n",
   "Maintain the cache file if it exists.\n" : "Maintenir le fichier de cache s'il existe.\n",
   "Never use cache file even if it exists.\n" : "Ne jamais utiliser le fichier cache même s'il existe.\n",
   "OpenAI Python Library\n" : "Bibliothèque Python OpenAI\n",
   "OpenAI authentication key.\n" : "Clé d'authentification OpenAI.\n",
   "OpenAI command line interface\n" : "Interface de ligne de commande OpenAI\n",
   "Option B<--xlate> calls B<--xlate-color> option with B<--color=never> option.\n" : "L'option B<--xlate> appelle l'option B<--xlate-color> avec l'option B<--color=never>.\n",
   "Pattern C<^(\\w.*\\n)+> means consecutive lines starting with alpha-numeric letter. This command show the area to be translated. Option B<--all> is used to produce entire text.\n" : "Le motif C<^(\\w.*\\n)+> signifie des lignes consécutives commençant par une lettre alpha-numérique. Cette commande montre la zone à traduire. L'option B<--all> est utilisée pour produire le texte entier.\n",
   "Print original and translated text in L<cpp(1)> C<#ifdef> format.\n" : "Impression du texte original et du texte traduit au format C<#ifdef> de L<cpp(1)>.\n",
   "Print original and translated text in L<git(1)> conflict marker format.\n" : "Imprimez le texte original et traduit au format de marqueur de conflit L<git(1)>.\n",
   "Print original and translated text separated by single blank line.\n" : "Imprimer le texte original et le texte traduit séparés par une seule ligne blanche.\n",
   "See the B<greple> manual for the detail about target text pattern. Use B<--inside>, B<--outside>, B<--include>, B<--exclude> options to limit the matching area.\n" : "Voir le manuel B<greple> pour les détails sur le modèle de texte cible. Utilisez les options B<--inside>, B<--outside>, B<--include>, B<--exclude> pour limiter la zone de correspondance.\n",
   "See the tranlsation result in real time in the STDERR output.\n" : "Voir le résultat de la traduction en temps réel dans la sortie STDERR.\n",
   "Set the whole text of the file as a target area.\n" : "Définissez l'ensemble du texte du fichier comme zone cible.\n",
   "Set your authentication key for DeepL service.\n" : "Définissez votre clé d'authentification pour le service DeepL.\n",
   "Specifies the translation engine to be used. If you specify the engine module directly, such as C<-Mxlate::deepl>, you do not need to use this option.\n" : "Spécifie le moteur de traduction à utiliser. Si vous spécifiez directement le module du moteur, tel que C<-Mxlate::deepl>, vous n'avez pas besoin d'utiliser cette option.\n",
   "Specify the maximum length of text to be sent to the API at once. Default value is set as for free DeepL account service: 128K for the API (B<--xlate>) and 5000 for the clipboard interface (B<--xlate-labor>). You may be able to change these value if you are using Pro service.\n" : "Spécifiez la longueur maximale du texte à envoyer à l'API en une seule fois. La valeur par défaut est la même que pour le service de compte gratuit DeepL : 128K pour l'API (B<--xlate>) et 5000 pour l'interface du presse-papiers (B<--xlate-labor>). Vous pouvez modifier ces valeurs si vous utilisez le service Pro.\n",
   "Specify the output format for original and translated text.\n" : "Spécifiez le format de sortie pour le texte original et le texte traduit.\n",
   "Specify the target language. You can get available languages by C<deepl languages> command when using B<DeepL> engine.\n" : "Spécifiez la langue cible. Vous pouvez obtenir les langues disponibles par la commande C<deepl languages> lorsque vous utilisez le moteur B<DeepL>.\n",
   "The B<--cache-clear> option can be used to initiate cache management or to refresh all existing cache data. Once executed with this option, a new cache file will be created if one does not exist and then automatically maintained afterward.\n" : "L'option B<--cache-clear> peut être utilisée pour initier la gestion du cache ou pour rafraîchir toutes les données du cache existant. Une fois exécutée avec cette option, un nouveau fichier de cache sera créé s'il n'en existe pas, puis automatiquement maintenu par la suite.\n",
   "Then add C<--xlate> option to translate the selected area. It will find and replace them by the B<deepl> command output.\n" : "Ensuite, ajoutez l'option C<--xlate> pour traduire la zone sélectionnée. Elle les trouvera et les remplacera par la sortie de la commande B<deepl>.\n",
   "Use B<sdif> to show conflict marker format side by side with B<-V> option.\n" : "Utilisez B<sdif> pour afficher le format des marqueurs de conflit côte à côte avec l'option B<-V>.\n",
   "With B<--xlate-fold> option, converted text is folded by the specified width. Default width is 70 and can be set by B<--xlate-fold-width> option. Four columns are reserved for run-in operation, so each line could hold 74 characters at most.\n" : "Avec l'option B<--xlate-fold>, le texte converti est plié selon la largeur spécifiée. La largeur par défaut est de 70 et peut être définie par l'option B<--xlate-fold-width>. Quatre colonnes sont réservées à l'opération de rodage, de sorte que chaque ligne peut contenir 74 caractères au maximum.\n",
   "Without this option, B<greple> behaves as a normal search command. So you can check which part of the file will be subject of the translation before invoking actual work.\n" : "Sans cette option, B<greple> se comporte comme une commande de recherche normale. Vous pouvez donc vérifier quelle partie du fichier fera l'objet de la traduction avant d'invoquer le travail réel.\n",
   "You can easily use this module from the command line by using the C<xlate> command included in the repository. See the C<xlate> help information for usage.\n" : "Vous pouvez facilement utiliser ce module à partir de la ligne de commande en utilisant la commande C<xlate> incluse dans le référentiel. Voir l'aide de C<xlate> pour l'utilisation.\n",
   "You can recover the original file by next L<sed(1)> command.\n" : "Vous pouvez récupérer le fichier original par la commande L<sed(1)> suivante.\n",
   "You can retrieve only Japanese text by the B<unifdef> command:\n" : "Vous pouvez récupérer uniquement le texte japonais par la commande B<unifdef> :\n",
   "You can use C<-Mupdate> module to modify files by the result of B<greple> command.\n" : "Vous pouvez utiliser le module C<-Mupdate> pour modifier les fichiers par le résultat de la commande B<greple>.\n",
   "You have to install command line tools for DeepL and ChatGPT.\n" : "Vous devez installer les outils de ligne de commande pour DeepL et ChatGPT.\n"
}
