{
   "App::Greple::xlate - translation support module for greple\n" : "App::Greple::xlate - модуль підтримки перекладу для greple\n",
   "B<Greple> B<xlate> module find text blocks and replace them by the translated text. Currently DeepL (F<deepl.pm>) and ChatGPT (F<gpt3.pm>) module are implemeted as a back-end engine.\n" : "Модулі B<Greple> B<xlate> знаходять текстові блоки і замінюють їх перекладеним текстом. Наразі в якості бекенд-рушія реалізовано модулі DeepL (F<deepl.pm>) та ChatGPT (F<gpt3.pm>).\n",
   "B<xlate> module can store cached text of translation for each file and read it before execution to eliminate the overhead of asking to server. With the default cache strategy C<auto>, it maintains cache data only when the cache file exists for target file.\n" : "Модуль B<xlate> може зберігати кешований текст перекладу для кожного файлу і зчитувати його перед виконанням, щоб усунути накладні витрати на запити до сервера. За замовчуванням стратегія кешування C<auto> зберігає кешовані дані лише тоді, коли для цільового файлу існує файл кешу.\n",
   "By default behavior, unused data is removed from the cache file. If you don't want to remove them and keep in the file, use C<accumulate>.\n" : "За замовчуванням, невикористані дані буде видалено з файлу кешу. Якщо ви не хочете видаляти їх і зберігати у файлі, скористайтеся командою C<accumulate>.\n",
   "By default, original and translated text is printed in the \"conflict marker\" format compatible with L<git(1)>. Using C<ifdef> format, you can get desired part by L<unifdef(1)> command easily. Output format can be specified by B<--xlate-format> option.\n" : "За замовчуванням оригінальний і перекладений текст виводиться у форматі \"конфліктний маркер\", сумісному з L<git(1)>. Використовуючи формат C<ifdef>, ви можете легко отримати потрібну частину за допомогою команди L<unifdef(1)>. Формат виводу можна вказати за допомогою опції B<--xlate-format>.\n",
   "Clear the cache data first.\n" : "Спочатку очистити дані кешу.\n",
   "Command result goes to standard out, so redirect to file if necessary, or consider to use L<App::Greple::update> module.\n" : "Результат команди буде виведено у стандартний вивід, тому за потреби переспрямуйте його на файл або скористайтеся модулем L<App::Greple::update>.\n",
   "Create empty cache file and exit.\n" : "Створити порожній файл кешу і вийти.\n",
   "DeepL Python library and CLI command.\n" : "DeepL Бібліотека Python і команда CLI.\n",
   "If the format is C<xtxt> (translated text) or unkown, only translated text is printed.\n" : "Якщо формат C<xtxt> (перекладений текст) або невідомий, друкується лише перекладений текст.\n",
   "If you want to translate entire text, use B<--match-all> option. This is a short-cut to specify the pattern C<(?s).+> which matches entire text.\n" : "Якщо ви хочете перекласти весь текст, використовуйте опцію B<--match-all>. Це швидкий спосіб вказати шаблон C<(?s).+>, який збігається з усім текстом.\n",
   "If you want to translate normal text blocks written in the L<pod> style, use B<greple> command with C<xlate::deepl> and C<perl> module like this:\n" : "Якщо ви хочете перекласти звичайні текстові блоки, написані у стилі L<pod>, використовуйте команду B<greple> з модулем C<xlate::deepl> та C<perl> таким чином:\n",
   "Insted of calling translation engine, you are expected to work for. After preparing text to be translated, they are copied to the clipboard. You are expected to paste them to the form, copy the result to the clipboard, and hit return.\n" : "Замість того, щоб викликати рушій перекладу, ви маєте працювати з ним. Після підготовки тексту для перекладу він копіюється в буфер обміну. Ви маєте вставити його у форму, скопіювати результат у буфер обміну і натиснути клавішу return.\n",
   "Invoke the translation process for each matched area.\n" : "Виклик процесу перекладу для кожної знайденої області.\n",
   "L<App::Greple::xlate::deepl>\n" : "L<App::Greple::xlate::deepl>\n",
   "L<App::Greple::xlate::gpt3>\n" : "L<App::Greple::xlate::gpt3>\n",
   "L<App::Greple::xlate>\n" : "L<App::Greple::xlate>\n",
   "L<https://github.com/DeepLcom/deepl-python>\n" : "L<https://github.com/DeepLcom/deepl-python>\n",
   "L<https://github.com/tecolicom/App-gpty>\n" : "L<https://github.com/tecolicom/App-gpty>\n",
   "Load the F<xlate.el> file included in the repository to use C<xlate> command from Emacs editor. C<xlate-region> function translate the given region. Default language is C<EN-US> and you can specify language invoking it with prefix argument.\n" : "Для використання команди C<xlate> з редактора Emacs завантажте файл F<xlate.el>, що входить до складу репозиторію. Функція C<xlate-region> перекладає заданий регіон. За замовчуванням використовується мова C<EN-US>, але ви можете вказати мову виклику за допомогою аргументу префікса.\n",
   "Maintain cache anyway as far as the target is normal file.\n" : "Зберігати кеш у будь-якому випадку, якщо цільовий файл є нормальним.\n",
   "Maintain the cache file if it exists.\n" : "Обслуговувати файл кешу, якщо він існує.\n",
   "Never use cache file even if it exists.\n" : "Ніколи не використовувати файл кешу, навіть якщо він існує.\n",
   "OpenAI Python Library\n" : "Бібліотека OpenAI на мові Python\n",
   "OpenAI authentication key.\n" : "Ключ автентифікації OpenAI.\n",
   "OpenAI command line interface\n" : "Інтерфейс командного рядка OpenAI\n",
   "Option B<--xlate> calls B<--xlate-color> option with B<--color=never> option.\n" : "Опція B<--xlate> викликає опцію B<--xlate-color> з опцією B<--color=never>.\n",
   "Pattern C<^(\\w.*\\n)+> means consecutive lines starting with alpha-numeric letter. This command show the area to be translated. Option B<--all> is used to produce entire text.\n" : "Шаблон C<^(\\w.*\\n)+> означає послідовні рядки, що починаються з буквено-цифрової літери. Ця команда показує область, яку потрібно перекласти. Параметр B<--all> використовується для перекладу всього тексту.\n",
   "Print original and translated text in L<cpp(1)> C<#ifdef> format.\n" : "Вивести оригінальний та перекладений текст у форматі L<cpp(1)> C<#ifdef>.\n",
   "Print original and translated text in L<git(1)> conflict marker format.\n" : "Вивести оригінальний і перекладений текст у форматі конфліктних маркерів L<git(1)>.\n",
   "Print original and translated text separated by single blank line.\n" : "Вивести текст оригіналу та перекладу, розділені одним порожнім рядком.\n",
   "See the B<greple> manual for the detail about target text pattern. Use B<--inside>, B<--outside>, B<--include>, B<--exclude> options to limit the matching area.\n" : "Детальніше про шаблон цільового тексту див. у посібнику B<greple>. Використовуйте опції B<--inside>, B<--outside>, B<--include>, B<--exclude> для обмеження області пошуку.\n",
   "See the tranlsation result in real time in the STDERR output.\n" : "Результат перекладу у реальному часі можна побачити у виводі STDERR.\n",
   "Set the whole text of the file as a target area.\n" : "Встановити весь текст файлу як цільову область.\n",
   "Set your authentication key for DeepL service.\n" : "Встановіть свій ключ автентифікації для сервісу DeepL.\n",
   "Specifies the translation engine to be used. If you specify the engine module directly, such as C<-Mxlate::deepl>, you do not need to use this option.\n" : "Вказує рушій перекладу, який буде використано. Якщо ви вказуєте модуль рушія безпосередньо, наприклад, C<-Mxlate::deepl>, вам не потрібно використовувати цей параметр.\n",
   "Specify the maximum length of text to be sent to the API at once. Default value is set as for free DeepL account service: 128K for the API (B<--xlate>) and 5000 for the clipboard interface (B<--xlate-labor>). You may be able to change these value if you are using Pro service.\n" : "Вкажіть максимальну довжину тексту, що надсилається до API за один раз. За замовчуванням встановлено значення, як для безкоштовного сервісу DeepL: 128K для API (B<--xlate>) і 5000 для інтерфейсу буфера обміну (B<--xlate-labor>). Ви можете змінити ці значення, якщо ви використовуєте Pro сервіс.\n",
   "Specify the output format for original and translated text.\n" : "Вкажіть формат виведення оригінального та перекладеного тексту.\n",
   "Specify the target language. You can get available languages by C<deepl languages> command when using B<DeepL> engine.\n" : "Вкажіть цільову мову. Доступні мови можна отримати за допомогою команди C<deepl languages> у разі використання рушія B<DeepL>.\n",
   "The B<--cache-clear> option can be used to initiate cache management or to refresh all existing cache data. Once executed with this option, a new cache file will be created if one does not exist and then automatically maintained afterward.\n" : "Параметр B<--cache-clear> може бути використано для ініціювання керування кешем або для оновлення усіх наявних даних кешу. Після виконання цього параметра буде створено новий файл кешу, якщо його не існує, а потім автоматично підтримуватиметься.\n",
   "Then add C<--xlate> option to translate the selected area. It will find and replace them by the B<deepl> command output.\n" : "Потім додайте опцію C<--xlate> для перекладу виділеної області. Вона знайде і замінить їх на виведені командою B<deepl>.\n",
   "Use B<sdif> to show conflict marker format side by side with B<-V> option.\n" : "Використовуйте B<sdif> для відображення формату конфліктних маркерів поряд з опцією B<-V>.\n",
   "With B<--xlate-fold> option, converted text is folded by the specified width. Default width is 70 and can be set by B<--xlate-fold-width> option. Four columns are reserved for run-in operation, so each line could hold 74 characters at most.\n" : "За допомогою опції B<--xlate-fold> перетворений текст буде згорнуто за вказаною шириною. За замовчуванням ширина складає 70 і може бути встановлена за допомогою параметра B<--xlate-fold-width>. Чотири стовпчики зарезервовано для обкатки, тому кожен рядок може містити не більше 74 символів.\n",
   "Without this option, B<greple> behaves as a normal search command. So you can check which part of the file will be subject of the translation before invoking actual work.\n" : "Без цього параметра B<greple> поводиться як звичайна команда пошуку. Таким чином, ви можете перевірити, яку частину файлу буде перекладено, перш ніж викликати процес перекладу.\n",
   "You can easily use this module from the command line by using the C<xlate> command included in the repository. See the C<xlate> help information for usage.\n" : "Ви можете легко використовувати цей модуль з командного рядка за допомогою команди C<xlate>, що входить до складу репозиторію. Див. довідкову інформацію щодо використання C<xlate>.\n",
   "You can recover the original file by next L<sed(1)> command.\n" : "Відновити вихідний файл можна наступною командою L<sed(1)>.\n",
   "You can retrieve only Japanese text by the B<unifdef> command:\n" : "За допомогою команди B<unifdef> можна отримати лише японський текст:\n",
   "You can use C<-Mupdate> module to modify files by the result of B<greple> command.\n" : "Ви можете скористатися модулем C<-Mupdate> для модифікації файлів за результатами виконання команди B<greple>.\n",
   "You have to install command line tools for DeepL and ChatGPT.\n" : "Вам потрібно встановити інструменти командного рядка для DeepL і ChatGPT.\n"
}
