{"See the B<greple> manual for the detail about target text pattern. Use B<--inside>, B<--outside>, B<--include>, B<--exclude> options to limit the matching area.\n":"Hedef metin kalıbı hakkında ayrıntılı bilgi için B<greple> kılavuzuna bakın. Eşleşen alanı sınırlamak için B<--inside>, B<--outside>, B<--include>, B<--exclude> seçeneklerini kullanın.\n","Specify the translation engine to be used. You don't have to use this option because module C<xlate::deepl> declares it as C<--xlate-engine=deepl>.\n":"Kullanılacak çeviri motorunu belirtin. Bu seçeneği kullanmak zorunda değilsiniz çünkü C<xlate::deepl> modülü bunu C<--xlate-engine=deepl> olarak bildirir.\n","By default behavior, unused data is removed from cache file. If you don't want to remove them and keep in the file, use C<accumulate>.\n":"Varsayılan davranış olarak, kullanılmayan veriler önbellek dosyasından kaldırılır. Bunları kaldırmak ve dosyada tutmak istemiyorsanız, C<accumulate> kullanın.\n","Specify the target language. You can get available languages by C<deepl languages> command when using B<DeepL> engine.\n":"Hedef dili belirtin. B<DeepL> motorunu kullanırken C<deepl languages> komutu ile mevcut dilleri alabilirsiniz.\n","DeepL Python library and CLI command.\n":"DeepL Python kütüphanesi ve CLI komutu.\n","Without this option, B<greple> behaves as a normal search command. So you can check which part of the file will be subject of the translation before invoking actual work.\n":"Bu seçenek olmadan, B<greple> normal bir arama komutu gibi davranır. Böylece, asıl işi çağırmadan önce dosyanın hangi bölümünün çeviriye tabi olacağını kontrol edebilirsiniz.\n","Specify the output format for original and translated text.\n":"Orijinal ve çevrilmiş metin için çıktı formatını belirtin.\n","Command result goes to standard out, so redirect to file if necessary, or consider to use L<App::Greple::update> module.\n":"Komut sonucu standart çıkışa gider, bu nedenle gerekirse dosyaya yönlendirin veya L<App::Greple::update> modülünü kullanmayı düşünün.\n","Use B<sdif> to show conflict marker format side by side with B<-V> option.\n":"B<-V> seçeneği ile çakışma işaretleyici formatını yan yana göstermek için B<sdif> kullanın.\n","If the format is C<none> or unkown, only translated text is printed.\n":"Eğer format C<none> veya unkown ise, sadece çevrilmiş metin yazdırılır.\n","You can recover the original file by next L<sed(1)> command.\n":"Bir sonraki L<sed(1)> komutu ile orijinal dosyayı kurtarabilirsiniz.\n","App::Greple::xlate - translation support module for greple\n":"App::Greple::xlate - greple için çeviri destek modülü\n","Then add C<--xlate> option to translate the selected area. It will find and replace them by the B<deepl> command output.\n":"Daha sonra seçilen alanı çevirmek için C<--xlate> seçeneğini ekleyin. B<deepl> komut çıktısı ile bunları bulacak ve değiştirecektir.\n","Set the whole text of the file as a target area.\n":"Dosyanın tüm metnini hedef alan olarak ayarlayın.\n","Option B<--xlate> calls B<--xlate-color> option with B<--color=never> option.\n":"B<--xlate> seçeneği B<--color=never> seçeneği ile B<--xlate-color> seçeneğini çağırır.\n","Maintain cache file if it exists.\n":"Eğer varsa önbellek dosyasını korur.\n","Pattern C<^(\\w.*\\n)+> means consecutive lines starting with alpha-numeric letter. This command show the area to be translated. Option B<--all> is used to produce entire text.\n":"C<^(\\w.*\\n)+> kalıbı alfa-nümerik harfle başlayan ardışık satırlar anlamına gelir. Bu komut çevrilecek alanı gösterir. B<--all> seçeneği tüm metni üretmek için kullanılır.\n","B<xlate> module can store cached text of translation for each file and read it before execution to eliminate the overhead of asking to server. With the default cache strategy C<auto>, it maintains cache data only when the cache file exists for target file. If the corresponding cache file does not exist, it does not create it.\n":"B<xlate> modülü her dosya için önbelleğe alınmış çeviri metnini saklayabilir ve sunucuya sorma ek yükünü ortadan kaldırmak için yürütmeden önce okuyabilir. Varsayılan önbellek stratejisi C<auto> ile, önbellek verilerini yalnızca hedef dosya için önbellek dosyası mevcut olduğunda tutar. İlgili önbellek dosyası mevcut değilse, oluşturmaz.\n","Create empty cache file and exit.\n":"Boş önbellek dosyası oluştur ve çık.\n","Maintain cache anyway as far as the target is normal file.\n":"Hedef normal dosya olduğu sürece önbelleği yine de korur.\n","Print original and translated text in L<cpp(1)> C<#ifdef> format.\n":"Orijinal ve çevrilmiş metni L<cpp(1)> C<#ifdef> biçiminde yazdırın.\n","Never use cache file even if it exists.\n":"Var olsa bile önbellek dosyasını asla kullanmayın.\n","Invoke the translation process for each matched area.\n":"Eşleşen her alan için çeviri işlemini çağırın.\n","With B<--xlate-fold> option, converted text is folded by the specified width. Default width is 70 and can be set by B<--xlate-fold-width> option. Four columns are reserved for run-in operation, so each line could hold 74 characters at most.\n":"B<--xlate-fold> seçeneği ile, dönüştürülen metin belirtilen genişlikte katlanır. Varsayılan genişlik 70'tir ve B<--xlate-fold-width> seçeneği ile ayarlanabilir. Çalıştırma işlemi için dört sütun ayrılmıştır, bu nedenle her satır en fazla 74 karakter alabilir.\n","Print original and translated text separated by single blank line.\n":"Orijinal ve çevrilmiş metni tek bir boş satırla ayırarak yazdırın.\n","Print original and translated text in L<git(1)> conflict marker format.\n":"Orijinal ve çevrilmiş metni L<git(1)> çakışma işaretleyici biçiminde yazdırın.\n","Set your authentication key for DeepL service.\n":"DeepL hizmeti için kimlik doğrulama anahtarınızı ayarlayın.\n","B<Greple> B<xlate> module find text blocks and replace them by the translated text. Currently only DeepL service is supported by the B<xlate::deepl> module.\n":"B<Greple> B<xlate> modülü metin bloklarını bulur ve bunları çevrilmiş metinle değiştirir. Şu anda sadece DeepL servisi B<xlate::deepl> modülü tarafından desteklenmektedir.\n","By default, original and translated text is printed in the \"conflict marker\" format compatible with L<git(1)>. Using C<ifdef> format, you can get desired part by L<unifdef(1)> command easily. Format can be specified by B<--xlate-format> option.\n":"Varsayılan olarak, orijinal ve çevrilmiş metin L<git(1)> ile uyumlu \"conflict marker\" formatında yazdırılır. C<ifdef> formatını kullanarak, L<unifdef(1)> komutu ile istediğiniz kısmı kolayca elde edebilirsiniz. Biçim B<--xlate-format> seçeneği ile belirtilebilir.\n","You can use C<-Mupdate> module to modify files by the result of B<greple> command.\n":"Dosyaları B<greple> komutunun sonucuna göre değiştirmek için C<-Mupdate> modülünü kullanabilirsiniz.\n","You can retrieve only Japanese text by the B<unifdef> command:\n":"B<unifdef> komutu ile sadece Japonca metni alabilirsiniz:\n","If you want to translate normal text block in L<pod> style document, use B<greple> command with C<xlate::deepl> and C<perl> module like this:\n":"L<pod> stili belgede normal metin bloğunu çevirmek istiyorsanız, B<greple> komutunu C<xlate::deepl> ve C<perl> modülü ile aşağıdaki gibi kullanın:\n","If you want to translate entire text, use B<--match-entire> option. This is a short-cut to specify the pattern matches entire text C<(?s).*>.\n":"Eğer metnin tamamını çevirmek istiyorsanız, B<--match-entire> seçeneğini kullanın. Bu, C<(?s).*> metninin tamamıyla eşleşen kalıbı belirtmek için bir kısa yoldur.\n","See the tranlsation result in real time in the STDERR output.\n":"Çeviri sonucunu STDERR çıktısında gerçek zamanlı olarak görün.\n"}