{
   "App::Greple::xlate - translation support module for greple\n" : "App::Greple::xlate - módulo de traducción para greple\n",
   "Automatic translation Docker environment with DeepL API (in Japanese)\n" : "Entorno Docker de traducción automática con DeepL API (en japonés)\n",
   "B<Greple> B<xlate> module find desired text blocks and replace them by the translated text. Currently DeepL (F<deepl.pm>) and ChatGPT (F<gpt3.pm>) module are implemented as a back-end engine. Experimental support for gpt-4 is also included.\n" : "El módulo B<Greple> B<xlate> encuentra los bloques de texto deseados y los sustituye por el texto traducido. Actualmente DeepL (F<deepl.pm>) y el módulo ChatGPT (F<gpt3.pm>) están implementados como motor back-end. También se incluye soporte experimental para gpt-4.\n",
   "B<xlate> module can store cached text of translation for each file and read it before execution to eliminate the overhead of asking to server. With the default cache strategy C<auto>, it maintains cache data only when the cache file exists for target file.\n" : "El módulo B<xlate> puede almacenar en caché el texto traducido de cada fichero y leerlo antes de la ejecución para eliminar la sobrecarga de preguntar al servidor. Con la estrategia de caché por defecto C<auto>, mantiene los datos de caché sólo cuando el archivo de caché existe para el archivo de destino.\n",
   "By default behavior, unused data is removed from the cache file. If you don't want to remove them and keep in the file, use C<accumulate>.\n" : "Por defecto, los datos no utilizados se eliminan del archivo de caché. Si no desea eliminarlos y mantenerlos en el archivo, utilice C<acumular>.\n",
   "By default, original and translated text is printed in the \"conflict marker\" format compatible with L<git(1)>. Using C<ifdef> format, you can get desired part by L<unifdef(1)> command easily. Output format can be specified by B<--xlate-format> option.\n" : "Por defecto, el texto original y traducido se imprime en el formato \"marcador de conflicto\" compatible con L<git(1)>. Usando el formato C<ifdef>, puede obtener la parte deseada mediante el comando L<unifdef(1)> fácilmente. El formato de salida puede especificarse mediante la opción B<--xlate-format>.\n",
   "Clear the cache data first.\n" : "Borrar primero los datos de la caché.\n",
   "Command result goes to standard out, so redirect to file if necessary, or consider to use L<App::Greple::update> module.\n" : "El resultado del comando va a la salida estándar, así que rediríjalo al archivo si es necesario, o considere usar el módulo L<App::Greple::update>.\n",
   "Create empty cache file and exit.\n" : "Crear un archivo de caché vacío y salir.\n",
   "DeepL Python library and CLI command.\n" : "DeepL Librería Python y comando CLI.\n",
   "Generating documents in 15 languages with DeepL API module (in Japanese)\n" : "Generación de documentos en 15 idiomas con el módulo API DeepL (en japonés)\n",
   "Greple module to translate and replace only the necessary parts with DeepL API (in Japanese)\n" : "Módulo Greple para traducir y sustituir sólo las partes necesarias con DeepL API (en japonés)\n",
   "If the format is C<xtxt> (translated text) or unkown, only translated text is printed.\n" : "Si el formato es C<xtxt> (texto traducido) o desconocido, sólo se imprime el texto traducido.\n",
   "If you want to translate entire text, use B<--match-all> option. This is a short-cut to specify the pattern C<(?s).+> which matches entire text.\n" : "Si desea traducir todo el texto, utilice la opción B<--match-all>. Es un atajo para especificar el patrón C<(?s).+> que coincide con todo el texto.\n",
   "If you want to translate normal text blocks in a document written in the Perl's pod style, use B<greple> command with C<xlate::deepl> and C<perl> module like this:\n" : "Si desea traducir bloques de texto normal en un documento escrito en el estilo vaina de Perl, utilice el comando B<greple> con el módulo C<xlate::deepl> y C<perl> de la siguiente manera:\n",
   "In this command, pattern string C<^(\\w.*\\n)+> means consecutive lines starting with alpha-numeric letter. This command show the area to be translated highlighted. Option B<--all> is used to produce entire text.\n" : "En este comando, la cadena patrón C<^(\\w.*\\n)+> significa líneas consecutivas que comienzan con una letra alfanumérica. Este comando muestra el área a traducir resaltada. La opción B<--all> se utiliza para producir el texto completo.\n",
   "Instead of calling translation engine, you are expected to work for. After preparing text to be translated, they are copied to the clipboard. You are expected to paste them to the form, copy the result to the clipboard, and hit return.\n" : "En lugar de llamar al motor de traducción, se espera que trabajen para. Después de preparar el texto a traducir, se copia en el portapapeles. Se espera que los pegue en el formulario, copie el resultado en el portapapeles y pulse Retorno.\n",
   "Invoke the translation process for each matched area.\n" : "Invoca el proceso de traducción para cada área coincidente.\n",
   "L<App::Greple::xlate::deepl>\n" : "L<App::Greple::xlate::deepl>\n",
   "L<App::Greple::xlate::gpt3>\n" : "L<App::Greple::xlate::gpt3>\n",
   "L<App::Greple::xlate>\n" : "L<App::Greple::xlate>\n",
   "L<https://github.com/DeepLcom/deepl-python>\n" : "L<https://github.com/DeepLcom/deepl-python>\n",
   "L<https://github.com/tecolicom/App-gpty>\n" : "L<https://github.com/tecolicom/App-gpty>\n",
   "L<https://hub.docker.com/r/tecolicom/xlate>\n" : "L<https://hub.docker.com/r/tecolicom/xlate>\n",
   "Load the F<xlate.el> file included in the repository to use C<xlate> command from Emacs editor. C<xlate-region> function translate the given region. Default language is C<EN-US> and you can specify language invoking it with prefix argument.\n" : "Cargue el fichero F<xlate.el> incluido en el repositorio para usar el comando C<xlate> desde el editor Emacs. La función C<xlate-region> traduce la región dada. El idioma por defecto es C<EN-US> y puede especificar el idioma invocándolo con el argumento prefijo.\n",
   "Maintain cache anyway as far as the target is normal file.\n" : "Mantener caché de todos modos hasta que el destino sea un archivo normal.\n",
   "Maintain the cache file if it exists.\n" : "Mantener el archivo de caché si existe.\n",
   "Never use cache file even if it exists.\n" : "No utilizar nunca el archivo de caché aunque exista.\n",
   "OpenAI Python Library\n" : "Biblioteca OpenAI Python\n",
   "OpenAI authentication key.\n" : "Clave de autenticación OpenAI.\n",
   "OpenAI command line interface\n" : "Interfaz de línea de comandos de OpenAI\n",
   "Option B<--xlate> calls B<--xlate-color> option with B<--color=never> option.\n" : "La opción B<--xlate> llama a la opción B<--xlate-color> con la opción B<--color=nunca>.\n",
   "Original and converted text are printed in L<cpp(1)> C<#ifdef> format.\n" : "El texto original y el convertido se imprimen en formato L<cpp(1)> C<#ifdef>.\n",
   "Original and converted text are printed in L<git(1)> conflict marker format.\n" : "El texto original y el convertido se imprimen en formato de marcador de conflicto L<git(1)>.\n",
   "Original and converted text are printed separated by single blank line.\n" : "El texto original y el convertido se imprimen separados por una sola línea en blanco.\n",
   "See the B<greple> manual for the detail about target text pattern. Use B<--inside>, B<--outside>, B<--include>, B<--exclude> options to limit the matching area.\n" : "Vea el manual B<greple> para los detalles sobre el patrón de texto objetivo. Utilice las opciones B<--inside>, B<--outside>, B<--include>, B<--exclude> para limitar el área de coincidencia.\n",
   "See the tranlsation result in real time in the STDERR output.\n" : "Ver el resultado de la traducción en tiempo real en la salida STDERR.\n",
   "Set the whole text of the file as a target area.\n" : "Establece todo el texto del fichero como área de destino.\n",
   "Set your authentication key for DeepL service.\n" : "Establezca su clave de autenticación para el servicio DeepL.\n",
   "Specifies the translation engine to be used. If you specify the engine module directly, such as C<-Mxlate::deepl>, you do not need to use this option.\n" : "Especifica el motor de traducción que se utilizará. Si especifica el módulo del motor directamente, como C<-Mxlate::deepl>, no necesita utilizar esta opción.\n",
   "Specify the maximum length of text to be sent to the API at once. Default value is set as for free DeepL account service: 128K for the API (B<--xlate>) and 5000 for the clipboard interface (B<--xlate-labor>). You may be able to change these value if you are using Pro service.\n" : "Especifique la longitud máxima del texto que se enviará a la API de una sola vez. El valor predeterminado es el mismo que para el servicio gratuito de cuenta DeepL: 128K para la API (B<--xlate>) y 5000 para la interfaz del portapapeles (B<--xlate-labor>). Puede cambiar estos valores si utiliza el servicio Pro.\n",
   "Specify the output format for original and translated text.\n" : "Especifique el formato de salida del texto original y traducido.\n",
   "Specify the target language. You can get available languages by C<deepl languages> command when using B<DeepL> engine.\n" : "Especifique el idioma de destino. Puede obtener los idiomas disponibles mediante el comando C<deepl languages> si utiliza el motor B<DeepL>.\n",
   "The B<--cache-clear> option can be used to initiate cache management or to refresh all existing cache data. Once executed with this option, a new cache file will be created if one does not exist and then automatically maintained afterward.\n" : "La opción B<--cache-clear> puede utilizarse para iniciar la gestión de la caché o para refrescar todos los datos de caché existentes. Una vez ejecutada esta opción, se creará un nuevo archivo de caché si no existe y se mantendrá automáticamente después.\n",
   "Then add C<--xlate> option to translate the selected area. Then, it will find the desired sections and replace them by the B<deepl> command output.\n" : "A continuación, añada la opción C<--xlate> para traducir el área seleccionada. Entonces, encontrará las secciones deseadas y las reemplazará por la salida del comando B<deepl>.\n",
   "Use B<sdif> to show conflict marker format side by side with B<-V> option.\n" : "Utilice B<sdif> para mostrar el formato del marcador de conflicto junto con la opción B<-V>.\n",
   "With B<--xlate-fold> option, converted text is folded by the specified width. Default width is 70 and can be set by B<--xlate-fold-width> option. Four columns are reserved for run-in operation, so each line could hold 74 characters at most.\n" : "Con la opción B<--xlate-fold>, el texto convertido se dobla por el ancho especificado. La anchura por defecto es 70 y puede ajustarse con la opción B<--xlate-fold-width>. Se reservan cuatro columnas para la operación de repliegue, por lo que cada línea puede contener 74 caracteres como máximo.\n",
   "Without this option, B<greple> behaves as a normal search command. So you can check which part of the file will be subject of the translation before invoking actual work.\n" : "Sin esta opción, B<greple> se comporta como un comando de búsqueda normal. Por lo tanto, puede comprobar qué parte del archivo será objeto de la traducción antes de invocar el trabajo real.\n",
   "You can easily use this module from the command line by using the C<xlate> command included in the repository. See the C<xlate> help information for usage.\n" : "Puede utilizar fácilmente este módulo desde la línea de comandos utilizando el comando C<xlate> incluido en el repositorio. Vea la información de ayuda de C<xlate> para su uso.\n",
   "You can recover the original file by next L<sed(1)> command.\n" : "Puede recuperar el archivo original con el siguiente comando L<sed(1)>.\n",
   "You can retrieve only Japanese text by the B<unifdef> command:\n" : "Puede recuperar sólo el texto japonés mediante el comando B<unifdef>:\n",
   "You can use C<-Mupdate> module to modify files by the result of B<greple> command.\n" : "Puede utilizar el módulo C<-Mupdate> para modificar archivos según el resultado del comando B<greple>.\n",
   "You have to install command line tools for DeepL and ChatGPT.\n" : "Debe instalar las herramientas de línea de comandos para DeepL y ChatGPT.\n"
}
