{
   "App::Greple::xlate - translation support module for greple\n" : "App::Greple::xlate - Greple용 번역 지원 모듈\n",
   "B<Greple> B<xlate> module find text blocks and replace them by the translated text. Currently DeepL (F<deepl.pm>) and ChatGPT (F<gpt3.pm>) module are implemeted as a back-end engine.\n" : "B<그레이플> B<엑스레이트> 모듈은 텍스트 블록을 찾아 번역된 텍스트로 대체합니다. 현재 DeepL (F<deepl.pm>) 및 ChatGPT (F<gpt3.pm>) 모듈이 백엔드 엔진으로 구현되어 있습니다.\n",
   "B<xlate> module can store cached text of translation for each file and read it before execution to eliminate the overhead of asking to server. With the default cache strategy C<auto>, it maintains cache data only when the cache file exists for target file.\n" : "B<엑스레이트> 모듈은 각 파일에 대한 번역 텍스트를 캐시하여 저장하고 실행 전에 읽어들여 서버에 요청하는 오버헤드를 없앨 수 있습니다. 기본 캐시 전략 C<auto>를 사용하면 대상 파일에 대한 캐시 파일이 존재할 때만 캐시 데이터를 유지합니다.\n",
   "By default behavior, unused data is removed from the cache file. If you don't want to remove them and keep in the file, use C<accumulate>.\n" : "기본 동작에 따라 사용하지 않는 데이터는 캐시 파일에서 제거됩니다. 제거하지 않고 파일에 유지하려면 C<accumulate>를 사용하세요.\n",
   "By default, original and translated text is printed in the \"conflict marker\" format compatible with L<git(1)>. Using C<ifdef> format, you can get desired part by L<unifdef(1)> command easily. Output format can be specified by B<--xlate-format> option.\n" : "기본적으로 원본 및 번역된 텍스트는 L<git(1)>과 호환되는 \"충돌 마커\" 형식으로 인쇄됩니다. C<ifdef> 형식을 사용하면 L<unifdef(1)> 명령으로 원하는 부분을 쉽게 얻을 수 있습니다. 출력 형식은 B<--xlate-format> 옵션으로 지정할 수 있습니다.\n",
   "Clear the cache data first.\n" : "캐시 데이터를 먼저 지웁니다.\n",
   "Command result goes to standard out, so redirect to file if necessary, or consider to use L<App::Greple::update> module.\n" : "명령 결과는 표준 아웃으로 이동하므로 필요한 경우 파일로 리디렉션하거나 L<App::Greple::update> 모듈을 사용하는 것을 고려할 수 있습니다.\n",
   "Create empty cache file and exit.\n" : "빈 캐시 파일을 생성하고 종료합니다.\n",
   "DeepL Python library and CLI command.\n" : "DeepL 파이썬 라이브러리 및 CLI 명령.\n",
   "If the format is C<xtxt> (translated text) or unkown, only translated text is printed.\n" : "형식이 C<xtxt>(번역된 텍스트) 또는 알 수 없는 경우 번역된 텍스트만 인쇄됩니다.\n",
   "If you want to translate entire text, use B<--match-all> option. This is a short-cut to specify the pattern C<(?s).+> which matches entire text.\n" : "전체 텍스트를 번역하려면 B<--match-all> 옵션을 사용합니다. 이는 전체 텍스트와 일치하는 C<(?s).+> 패턴을 지정하는 단축키입니다.\n",
   "If you want to translate normal text blocks written in the L<pod> style, use B<greple> command with C<xlate::deepl> and C<perl> module like this:\n" : "L<pod> 스타일로 작성된 일반 텍스트 블록을 번역하려면 다음과 같이 B<greple> 명령어와 C<xlate::deep> 및 C<perl> 모듈을 함께 사용하면 됩니다:\n",
   "Insted of calling translation engine, you are expected to work for. After preparing text to be translated, they are copied to the clipboard. You are expected to paste them to the form, copy the result to the clipboard, and hit return.\n" : "번역 엔진을 호출하는 대신 작업할 것으로 예상됩니다. 번역할 텍스트를 준비한 후 클립보드에 복사합니다. 양식에 붙여넣고 결과를 클립보드에 복사한 후 Return 키를 눌러야 합니다.\n",
   "Invoke the translation process for each matched area.\n" : "일치하는 각 영역에 대해 번역 프로세스를 호출합니다.\n",
   "L<App::Greple::xlate::deepl>\n" : "L<App::Greple::xlate::deepl>\n",
   "L<App::Greple::xlate::gpt3>\n" : "L<App::Greple::xlate::gpt3>\n",
   "L<App::Greple::xlate>\n" : "L<App::Greple::xlate>\n",
   "L<https://github.com/DeepLcom/deepl-python>\n" : "L<https://github.com/DeepLcom/deepl-python>\n",
   "L<https://github.com/tecolicom/App-gpty>\n" : "L<https://github.com/tecolicom/App-gpty>\n",
   "Load the F<xlate.el> file included in the repository to use C<xlate> command from Emacs editor. C<xlate-region> function translate the given region. Default language is C<EN-US> and you can specify language invoking it with prefix argument.\n" : "저장소에 포함된 F<xlate.el> 파일을 로드하여 Emacs 편집기에서 C<xlate> 명령을 사용합니다. C<xlate-region> 함수는 지정된 지역을 번역합니다. 기본 언어는 C<EN-US>이며 접두사 인수를 사용하여 호출하는 언어를 지정할 수 있습니다.\n",
   "Maintain cache anyway as far as the target is normal file.\n" : "타겟이 정상 파일인 한 캐시를 유지합니다.\n",
   "Maintain the cache file if it exists.\n" : "캐시 파일이 있는 경우 캐시 파일을 유지 관리합니다.\n",
   "Never use cache file even if it exists.\n" : "캐시 파일이 존재하더라도 절대 사용하지 않습니다.\n",
   "OpenAI Python Library\n" : "OpenAI 파이썬 라이브러리\n",
   "OpenAI authentication key.\n" : "OpenAI 인증 키.\n",
   "OpenAI command line interface\n" : "OpenAI 명령줄 인터페이스\n",
   "Option B<--xlate> calls B<--xlate-color> option with B<--color=never> option.\n" : "옵션 B<--xlate>는 B<--color=never> 옵션과 함께 B<--xlate-color> 옵션을 호출합니다.\n",
   "Pattern C<^(\\w.*\\n)+> means consecutive lines starting with alpha-numeric letter. This command show the area to be translated. Option B<--all> is used to produce entire text.\n" : "패턴 C<^(\\w.*\\n)+>는 영숫자로 시작하는 연속된 줄을 의미합니다. 이 명령은 번역할 영역을 표시합니다. 옵션 B<--all>은 전체 텍스트를 생성하는 데 사용됩니다.\n",
   "Print original and translated text in L<cpp(1)> C<#ifdef> format.\n" : "원본 텍스트와 번역 텍스트를 L<cpp(1)> C<#ifdef> 형식으로 인쇄합니다.\n",
   "Print original and translated text in L<git(1)> conflict marker format.\n" : "원본 텍스트와 번역 텍스트를 L<git(1)> 충돌 마커 형식으로 인쇄합니다.\n",
   "Print original and translated text separated by single blank line.\n" : "원본 텍스트와 번역 텍스트를 빈 줄로 구분하여 인쇄합니다.\n",
   "See the B<greple> manual for the detail about target text pattern. Use B<--inside>, B<--outside>, B<--include>, B<--exclude> options to limit the matching area.\n" : "대상 텍스트 패턴에 대한 자세한 내용은 B<greple> 매뉴얼을 참조하세요. B<--내부>, B<--외부>, B<--포함>, B<--제외> 옵션을 사용하여 일치하는 영역을 제한할 수 있습니다.\n",
   "See the tranlsation result in real time in the STDERR output.\n" : "번역 결과는 STDERR 출력에서 실시간으로 확인할 수 있습니다.\n",
   "Set the whole text of the file as a target area.\n" : "파일의 전체 텍스트를 대상 영역으로 설정합니다.\n",
   "Set your authentication key for DeepL service.\n" : "DeepL 서비스에 대한 인증 키를 설정합니다.\n",
   "Specifies the translation engine to be used. If you specify the engine module directly, such as C<-Mxlate::deepl>, you do not need to use this option.\n" : "사용할 번역 엔진을 지정합니다. C<-Mxlate::deep>과 같이 엔진 모듈을 직접 지정하는 경우에는 이 옵션을 사용할 필요가 없습니다.\n",
   "Specify the maximum length of text to be sent to the API at once. Default value is set as for free DeepL account service: 128K for the API (B<--xlate>) and 5000 for the clipboard interface (B<--xlate-labor>). You may be able to change these value if you are using Pro service.\n" : "한 번에 API로 전송할 텍스트의 최대 길이를 지정합니다. 기본값은 무료 DeepL 계정 서비스의 경우 API의 경우 128K(B<--xlate>), 클립보드 인터페이스의 경우 5000(B<--xlate-labor>)으로 설정되어 있습니다. Pro 서비스를 사용하는 경우 이 값을 변경할 수 있습니다.\n",
   "Specify the output format for original and translated text.\n" : "원본 및 번역 텍스트의 출력 형식을 지정합니다.\n",
   "Specify the target language. You can get available languages by C<deepl languages> command when using B<DeepL> engine.\n" : "대상 언어를 지정합니다. B<DeepL> 엔진을 사용할 때 C<deepl languages> 명령으로 사용 가능한 언어를 가져올 수 있습니다.\n",
   "The B<--cache-clear> option can be used to initiate cache management or to refresh all existing cache data. Once executed with this option, a new cache file will be created if one does not exist and then automatically maintained afterward.\n" : "B<--cache-clear> 옵션은 캐시 관리를 시작하거나 기존의 모든 캐시 데이터를 새로 고치는 데 사용할 수 있습니다. 이 옵션을 실행하면 캐시 파일이 없는 경우 새 캐시 파일이 생성되고 이후에는 자동으로 유지 관리됩니다.\n",
   "Then add C<--xlate> option to translate the selected area. It will find and replace them by the B<deepl> command output.\n" : "그런 다음 C<--엑스레이트> 옵션을 추가하여 선택한 영역을 번역합니다. B<딥> 명령 출력으로 해당 영역을 찾아서 대체합니다.\n",
   "Use B<sdif> to show conflict marker format side by side with B<-V> option.\n" : "충돌 마커 형식을 B<-V> 옵션과 함께 나란히 표시하려면 B<에스디프>를 사용합니다.\n",
   "With B<--xlate-fold> option, converted text is folded by the specified width. Default width is 70 and can be set by B<--xlate-fold-width> option. Four columns are reserved for run-in operation, so each line could hold 74 characters at most.\n" : "B<--xlate-fold> 옵션을 사용하면 변환된 텍스트가 지정된 너비만큼 접힙니다. 기본 너비는 70이며 B<--xlate-fold-width> 옵션으로 설정할 수 있습니다. 실행 작업을 위해 4개의 열이 예약되어 있으므로 각 줄에는 최대 74자가 들어갈 수 있습니다.\n",
   "Without this option, B<greple> behaves as a normal search command. So you can check which part of the file will be subject of the translation before invoking actual work.\n" : "이 옵션이 없으면 B<greple>은 일반 검색 명령처럼 작동합니다. 따라서 실제 작업을 호출하기 전에 파일에서 어느 부분이 번역 대상이 될지 확인할 수 있습니다.\n",
   "You can easily use this module from the command line by using the C<xlate> command included in the repository. See the C<xlate> help information for usage.\n" : "리포지토리에 포함된 C<xlate> 명령을 사용하여 명령줄에서 이 모듈을 쉽게 사용할 수 있습니다. 사용법은 C<xlate> 도움말 정보를 참조하세요.\n",
   "You can recover the original file by next L<sed(1)> command.\n" : "다음 L<sed(1)> 명령으로 원본 파일을 복구할 수 있습니다.\n",
   "You can retrieve only Japanese text by the B<unifdef> command:\n" : "일본어 텍스트만 검색하려면 B<unifdef> 명령으로 검색할 수 있습니다:\n",
   "You can use C<-Mupdate> module to modify files by the result of B<greple> command.\n" : "C<-Mupdate> 모듈을 사용하여 B<greple> 명령의 결과에 따라 파일을 수정할 수 있습니다.\n",
   "You have to install command line tools for DeepL and ChatGPT.\n" : "DeepL 및 ChatGPT용 명령줄 도구를 설치해야 합니다.\n"
}
