{"Pattern C<^(\\w.*\\n)+> means consecutive lines starting with alpha-numeric letter. This command show the area to be translated. Option B<--all> is used to produce entire text.\n":"パターン C<^(\\w.*n)+> は、英数字で始まる連続した行を意味します。このコマンドは、翻訳される領域を表示します。オプションB<--all>は、テキスト全体を翻訳するために使用します。\n","By default behavior, unused data is removed from the cache file. If you don't want to remove them and keep in the file, use C<accumulate>.\n":"デフォルトの動作では、未使用のデータはキャッシュファイルから削除されます。削除せずに残しておきたい場合は、C<蓄積>を使用してください。\n","See the B<greple> manual for the detail about target text pattern. Use B<--inside>, B<--outside>, B<--include>, B<--exclude> options to limit the matching area.\n":"対象テキストパターンの詳細については、B<greple>のマニュアルを参照してください。B<--inside>, B<--outside>, B<--include>, B<--exclude>オプションでマッチング範囲を限定することができます。\n","Set your authentication key for DeepL service.\n":"DeepLサービス用の認証キーを設定します。\n","With B<--xlate-fold> option, converted text is folded by the specified width. Default width is 70 and can be set by B<--xlate-fold-width> option. Four columns are reserved for run-in operation, so each line could hold 74 characters at most.\n":"B<--xlate-fold>オプションでは、変換されたテキストを指定した幅で折り返す。デフォルトの幅は70で、B<--xlate-fold-width>オプションで設定することができる。ランイン動作のために4列が確保されているので、1行には最大で74文字が格納できる。\n","You can retrieve only Japanese text by the B<unifdef> command:\n":"B<unifdef>コマンドで日本語テキストのみを取り出すことができます。\n","The B<--cache-clear> option can be used to initiate cache management or to refresh all existing cache data. Once executed with this option, a new cache file will be created if one does not exist and then automatically maintained afterward.\n":"B<--cache-clear>オプションは、キャッシュ管理を開始するか、既存のキャッシュデータをすべてリフレッシュするために使用される。このオプションを一度実行すると、キャッシュファイルが存在しない場合は新規に作成され、その後は自動的にメンテナンスされる。\n","If the format is C<xtxt> (translated text) or unkown, only translated text is printed.\n":"フォーマットがC<xtxt>（翻訳文）またはunknownの場合、翻訳文のみが印刷されます。\n","Print original and translated text separated by single blank line.\n":"原文と訳文を1行の空白で区切って表示する。\n","Create empty cache file and exit.\n":"空のキャッシュファイルを作成し、終了する。\n","App::Greple::xlate - translation support module for greple\n":"App::Greple::xlate - greple 用の翻訳サポートモジュール\n","B<xlate> module can store cached text of translation for each file and read it before execution to eliminate the overhead of asking to server. With the default cache strategy C<auto>, it maintains cache data only when the cache file exists for target file.\n":"B<xlate>モジュールは、各ファイルの翻訳テキストをキャッシュしておき、実行前にそれを読むことで、サーバーへの問い合わせのオーバーヘッドをなくすことができます。デフォルトのキャッシュ戦略C<auto>では、対象ファイルに対してキャッシュファイルが存在する場合のみ、キャッシュデータを保持する。\n","You can recover the original file by next L<sed(1)> command.\n":"次のL<sed(1)>コマンドで元のファイルを復元することができます。\n","Print original and translated text in L<cpp(1)> C<#ifdef> format.\n":"原文と訳文をL<cpp(1)> C<#ifdef>形式で出力します。\n","Specify the output format for original and translated text.\n":"原文と訳文の出力形式を指定する。\n","Command result goes to standard out, so redirect to file if necessary, or consider to use L<App::Greple::update> module.\n":"コマンドの結果は標準出力されますので、必要に応じてファイルにリダイレクトするか、L<App::Greple::update>モジュールの使用を検討してください。\n","Print original and translated text in L<git(1)> conflict marker format.\n":"原文と訳文をL<git(1)>コンフリクトマーカ形式で出力する。\n","Invoke the translation process for each matched area.\n":"マッチした領域ごとに翻訳処理を起動します。\n","If you want to translate normal text block in L<pod> style document, use B<greple> command with C<xlate::deepl> and C<perl> module like this:\n":"L<pod>形式の文書中の通常のテキストブロックを翻訳したい場合は、B<greple>コマンドとC<xlate::deepl>モジュール、C<perl>モジュールを使って、以下のようにします。\n","Without this option, B<greple> behaves as a normal search command. So you can check which part of the file will be subject of the translation before invoking actual work.\n":"このオプションがない場合、B<greple>は通常の検索コマンドとして動作します。したがって、ファイルのどの部分が翻訳の対象となるかを、実際の作業を始める前に確認することができます。\n","You can use C<-Mupdate> module to modify files by the result of B<greple> command.\n":"C<-Mupdate>モジュールを用いると、B<greple>コマンドの結果をもとにファイルを修正することができます。\n","Then add C<--xlate> option to translate the selected area. It will find and replace them by the B<deepl> command output.\n":"次に、C<--xlate>オプションを追加して、選択された領域を翻訳する。これは、B<deepl>コマンドの出力でそれらを見つけて置き換えます。\n","Use B<sdif> to show conflict marker format side by side with B<-V> option.\n":"B<sdif>を使用すると、B<-V>オプションでコンフリクトマーカー形式を並べて表示することができます。\n","Specify the translation engine to be used. You don't have to use this option because module C<xlate::deepl> declares it as C<--xlate-engine=deepl>.\n":"使用する翻訳エンジンを指定する。モジュールC<xlate::deepl>でC<--xlate-engine=deepl>と宣言されているので、このオプションを使う必要はない。\n","Set the whole text of the file as a target area.\n":"ファイルの全テキストを対象範囲に設定する。\n","L<App::Greple::xlate>\n":"L<App::Greple::xlate>を使用します。\n","Clear the cache data first.\n":"キャッシュデータを先にクリアする。\n","See the tranlsation result in real time in the STDERR output.\n":"翻訳結果はSTDERR出力にリアルタイムで表示されます。\n","Maintain cache anyway as far as the target is normal file.\n":"対象が通常ファイルである限り、とにかくキャッシュを維持する。\n","By default, original and translated text is printed in the \"conflict marker\" format compatible with L<git(1)>. Using C<ifdef> format, you can get desired part by L<unifdef(1)> command easily. Format can be specified by B<--xlate-format> option.\n":"デフォルトでは、原文と訳文が L<git(1)> と互換性のある \"conflict marker\" フォーマットで出力されます。C<ifdef> 形式を用いると、L<unifdef(1)> コマンドで簡単に目的の部分を得ることができます。B<--xlate-format>オプションでフォーマットを指定することができます。\n","Maintain the cache file if it exists.\n":"キャッシュファイルが存在する場合は、それを維持する。\n","If you want to translate entire text, use B<--match-all> option. This is a short-cut to specify the pattern matches entire text C<(?s).+>.\n":"テキスト全体を翻訳したい場合は、B<--match-all>オプションを使用します。これは、テキスト全体にマッチするパターンを指定するためのショートカットです C<(?s).+>.\n","B<Greple> B<xlate> module find text blocks and replace them by the translated text. Currently only DeepL service is supported by the B<xlate::deepl> module.\n":"B<Greple> B<xlate> モジュールは、テキストブロックを見つけ、翻訳されたテキストに置き換えます。現在、B<xlate::deepl>モジュールが対応しているのはDeepLサービスのみです。\n","Never use cache file even if it exists.\n":"キャッシュファイルが存在しても決して使用しない。\n","Option B<--xlate> calls B<--xlate-color> option with B<--color=never> option.\n":"B<--xlate>オプションは、B<--xlate-color>オプションをB<--color=never>オプションで呼び出します。\n","Specify the target language. You can get available languages by C<deepl languages> command when using B<DeepL> engine.\n":"対象言語を指定します。B<DeepL>エンジンを使っている場合は、C<deepl languages>コマンドで利用可能な言語を得ることができます。\n","Insted of calling translation engine, you are expected to work for. After preparing text to be translated, they are copied to the clipboard. You are expected to paste them to the form, copy the result to the clipboard, and hit return.\n":"翻訳エンジンを呼び出す代わりに、あなたが働くことが期待されています。翻訳するテキストを用意すると、それがクリップボードにコピーされる。それをフォームに貼り付け、結果をクリップボードにコピーし、リターンキーを押すことが期待される。\n","DeepL Python library and CLI command.\n":"DeepL の Python ライブラリと CLI コマンド。\n","Specify the maximum length of text to be sent to the API at once. Default value is set as for free account service: 128K for the API (B<--xlate>) and 5000 for the clipboard interface (B<--xlate-labor>). You may be able to change these value if you are using Pro service.\n":"APIに一度に送信するテキストの最大長を指定します。初期値は、無料アカウントサービスの場合、API（B<--xlate>）は128K、クリップボードインターフェース（B<--xlate-labor>）は5000に設定されています。Proサービスをご利用の場合は、これらの値を変更することができます。\n"}