{"# Greple -Mxlate モジュール サンプルファイル\n":"# Greple -Mxlate module sample files\n","- `*.pptx`\n":"- `*.pptx`, `*.pptx`, and `*.txt`.\n","このディレクトリには、Greple の -Mxlate モジュールを使ってファイルを自動翻訳する例が含まれています。\n":"This directory contains examples of automatic file translation using Greple's -Mxlate module.\n","### *.FORMAT\n":"### *.FORMAT\n","有料アカウントを使っていて、処理する文字数に制限がない場合には `MAXLEN` という変数に上限を設定して実行してください。\n":"If you are using a paid account and there is no limit to the number of characters to process, set the variable `MAXLEN` to the upper limit and run.\n","- `*.docx`\n":"- `*.docx`, `*.pptx`, and `*.pptx`.\n","### USEAPI\n":"### USEAPI\n","翻訳対象言語の指定。\n":"Specify the language to be translated.\n","対象ファイルに特定の拡張子が付いたファイルがあると、その内容によって翻訳処理を制御することができます。たとえば、`Document.txt` というファイルと共に `Document.txt.LANG` というファイルがあれば、その中に書かれている言語に翻訳します。\n":"If the target file has a file with a specific extension, the translation process can be controlled by its contents. For example, if there is a file called `Document.txt.LANG` along with a file called `Document.txt`, the translation will be done in the language written in the file.\n","API を使って翻訳する場合には `deepl` コマンドがインストールされている必要があります。`USEAPI` という変数をセットして make を実行してください。\n":"To translate using the API, the `deepl` command must be installed. Set the variable `USEAPI` and run make.\n","### DEBUG\n":"### DEBUG\n","一度に処理する最大文字数を設定します。\n":"Set the maximum number of characters to process at one time.\n","- `*.md`\n":"- `*.md`\n","## 生成ファイル\n":"## Generated files\n","翻訳形式を指定。`xtxt`、`cm`、`ifdef` の中から指定します。\n":"Specify the format of translation. Specify the translation format from `xtxt`, `cm`, or `ifdef`.\n","という3つのファイルが生成されます。`xtxt` ファイルには、翻訳済みの文章のみ、`cm` と `ifdef` には原文と翻訳文章の両方が含まれます。\n":"For example, to translate the file `Document.txt` into Japanese, three files named The `xtxt` file contains only the translated text, while the `cm` and `ifdef` files contain both the original and translated text.\n","たとえば、`Document.txt` というファイルを日本語に翻訳する場合、\n":"For example, if you want to translate the file `Document.txt` into Japanese, three files named\n","### *.LANG\n":"### *.LANG\n","フリーアカウントで実行している場合には、一度に5000文字までしか処理できないので、すべてのテキストの処理が終わるまでこの作業を繰り返します。\n":"If you are running with a free account, you can only process up to 5000 characters at a time, so repeat this process until all text has been processed.\n","- `*.pm`\n":"- `*.pm`\n","特に指定がない場合には、翻訳対象言語毎に `xtxt`, `cm`, `ifdef` の3種類のファイルが作られます。\n":"If not specified, three types of files, `xtxt`, `cm`, and `ifdef`, will be generated for each target language.\n","## make で利用する変数\n":"## Variables used in make\n","### API を利用する\n":"### Use API\n","### 文字数制限\n":"### character limit\n","## 翻訳処理\n":"## translation process\n","DeepL の API を使って翻訳します。\n":"Translate using the DeepL API.\n","翻訳したい文書ファイルを置いて、make コマンドを実行するだけで必要なファイルを生成します。現時点で対象としているのは、以下の種類のファイルです。\n":"Simply place the document file to be translated and execute the make command to generate the necessary file. The following types of files are currently covered.\n","## 制御ファイル\n":"## Control files\n","### MAXLEN\n":"### MAXLEN\n","- `*.txt`\n":"- `*.txt`\n","デフォルトの動作では、翻訳対象となるテキストをクリップボードにコピーして、翻訳処理を促すプロンプトが表示されます。DeepL のアプリケーションやウェブインタフェースを使ってそれを翻訳し、結果を再びクリップボードにコピーして、エンターキーを入力します。\n":"The default behavior is to copy the text to be translated to the clipboard, prompt for the translation process, translate it using the application or web interface at DeepL, copy the result back to the clipboard, and hit enter.\n","デバッグモードをオンにします。\n":"Turns on debug mode.\n"}