{"App::Greple::xlate - translation support module for greple\n":"App::Greple::xlate - modul de suport pentru traducere pentru Greple\n","See the B<greple> manual for the detail about target text pattern. Use B<--inside>, B<--outside>, B<--include>, B<--exclude> options to limit the matching area.\n":"Consultați manualul B<greple> pentru detalii despre modelul de text țintă. Utilizați opțiunile B<--inside>, B<--outside>, B<--include>, B<--exclude> pentru a limita zona de potrivire.\n","If you want to translate entire text, use B<--match-entire> option. This is a short-cut to specify the pattern matches entire text C<(?s).*>.\n":"Dacă doriți să traduceți întregul text, utilizați opțiunea B<--match-entire>. Aceasta este o prescurtare pentru a specifica modelul se potrivește cu întregul text C<(?s).*>.\n","Create empty cache file and exit.\n":"Creează un fișier cache gol și iese.\n","Maintain cache file if it exists.\n":"Menține fișierul cache dacă există.\n","DeepL Python library and CLI command.\n":"DeepL Biblioteca Python și comanda CLI.\n","Print original and translated text separated by single blank line.\n":"Tipăriți textul original și tradus separate de o singură linie albă.\n","This library is free software; you can redistribute it and/or modify it under the same terms as Perl itself.\n":"Această bibliotecă este software liber; puteți să o redistribuiți și/sau să o modificați în aceiași termeni ca și Perl însuși.\n","Set the whole text of the file as a target area.\n":"Setați întregul text al fișierului ca zonă țintă.\n","With B<--xlate-fold> option, converted text is folded by the specified width. Default width is 70 and can be set by B<--xlate-fold-width> option. Four columns are reserved for run-in operation, so each line could hold 74 characters at most.\n":"Cu opțiunea B<--xlate-fold>, textul convertit este pliat cu lățimea specificată. Lățimea implicită este 70 și poate fi stabilită prin opțiunea B<--xlate-fold-width>. Patru coloane sunt rezervate pentru operațiunea de rulare, astfel încât fiecare linie poate conține cel mult 74 de caractere.\n","Then add C<--xlate> option to translate the selected area. It will find and replace them by the B<deepl> command output.\n":"Apoi se adaugă opțiunea C<--xlate> pentru a traduce zona selectată. Aceasta le va găsi și le va înlocui cu ieșirea comenzii B<deepl>.\n","Command result goes to standard out, so redirect to file if necessary, or consider to use L<App::Greple::update> module.\n":"Rezultatul comenzii merge la ieșire standard, deci redirecționați-l către fișier dacă este necesar sau luați în considerare utilizarea modulului L<App::Greple::update>.\n","If you want to translate normal text block in L<pod> style document, use B<greple> command with C<xlate::deepl> and C<perl> module like this:\n":"Dacă doriți să traduceți un bloc de text normal într-un document în stil L<pod>, utilizați comanda B<greple> cu modulul C<xlate::deepl> și C<perl> astfel:\n","See the tranlsation result in real time in the STDERR output.\n":"Vedeți rezultatul traducerii în timp real în ieșirea STDERR.\n","Option B<--xlate> calls B<--xlate-color> option with B<--color=never> option.\n":"Opțiunea B<--xlate> apelează opțiunea B<--xlate-color> cu opțiunea B<--color=niciodată>.\n","Specify the target language. You can get available languages by C<deepl languages> command when using B<DeepL> engine.\n":"Specificați limba țintă. Puteți obține limbile disponibile prin comanda C<deepl languages> atunci când se utilizează motorul B<DeepL>.\n","Print original and translated text in L<git(1)> conflict marker format.\n":"Tipăriți textul original și tradus în formatul de marcare a conflictului L<git(1)>.\n","Maintain cache anyway as far as the target is normal file.\n":"Menține oricum memoria cache în măsura în care fișierul țintă este un fișier normal.\n","B<Greple> B<xlate> module find text blocks and replace them by the translated text. Currently only DeepL service is supported by the B<xlate::deepl> module.\n":"Modulul B<Greple> B<xlate> găsește blocurile de text și le înlocuiește cu textul tradus. În prezent, numai serviciul DeepL este suportat de modulul B<xlate::deepl>.\n","Pattern C<^(\\w.*\\n)+> means consecutive lines starting with alpha-numeric letter. This command show the area to be translated. Option B<--all> is used to produce entire text.\n":"Modelul C<^(\\w.*\\n)+> înseamnă linii consecutive care încep cu o literă alfanumerică. Această comandă arată zona care urmează să fie tradusă. Opțiunea B<--all> este utilizată pentru a produce întregul text.\n","By default behavior, unused data is removed from cache file. If you don't want to remove them and keep in the file, use C<accumulate>.\n":"Prin comportament implicit, datele neutilizate sunt eliminate din fișierul cache. Dacă nu doriți să le eliminați și să le păstrați în fișier, utilizați C<acumulez>.\n","You can retrieve only Japanese text by the B<unifdef> command:\n":"Puteți recupera doar textul japonez prin comanda B<unifdef>:\n","Copyright ©︎ 2023 Kazumasa Utashiro.\n":"Copyright ©︎ 2023 Kazumasa Utashiro.\n","Never use cache file even if it exists.\n":"Nu utilizează niciodată fișierul cache, chiar dacă există.\n","You can use C<-Mupdate> module to modify files by the result of B<greple> command.\n":"Puteți utiliza modulul C<-Mupdate> pentru a modifica fișierele în funcție de rezultatul comenzii B<greple>.\n","If the format is C<none> or unkown, only translated text is printed.\n":"Dacă formatul este C<none> sau necunoscut, se tipărește numai textul tradus.\n","Specify the output format for original and translated text.\n":"Specificați formatul de ieșire pentru textul original și cel tradus.\n","Set your authentication key for DeepL service.\n":"Setați cheia de autentificare pentru serviciul DeepL.\n","Use B<sdif> to show conflict marker format side by side with B<-V> option.\n":"Folosiți B<sdif> pentru a afișa formatul markerilor de conflict unul lângă altul cu opțiunea B<-V>.\n","Without this option, B<greple> behaves as a normal search command. So you can check which part of the file will be subject of the translation before invoking actual work.\n":"Fără această opțiune, B<greple> se comportă ca o comandă de căutare normală. Astfel, puteți verifica ce parte a fișierului va face obiectul traducerii înainte de a invoca lucrul efectiv.\n","You can recover the original file by next L<sed(1)> command.\n":"Puteți recupera fișierul original prin următoarea comandă L<sed(1)>.\n","Specify the translation engine to be used. You don't have to use this option because module C<xlate::deepl> declares it as C<--xlate-engine=deepl>.\n":"Specificați motorul de traducere care urmează să fie utilizat. Nu este necesar să utilizați această opțiune deoarece modulul C<xlate::deepl> o declară ca fiind C<--xlate-engine=depl>.\n","Invoke the translation process for each matched area.\n":"Invocați procesul de traducere pentru fiecare zonă corespunzătoare.\n","By default, original and translated text is printed in the \"conflict marker\" format compatible with L<git(1)>. Using C<ifdef> format, you can get desired part by L<unifdef(1)> command easily. Format can be specified by B<--xlate-format> option.\n":"În mod implicit, textul original și cel tradus sunt tipărite în formatul \"conflict marker\" compatibil cu L<git(1)>. Utilizând formatul C<ifdef>, puteți obține cu ușurință partea dorită prin comanda L<unifdef(1)>. Formatul poate fi specificat prin opțiunea B<--xlate-format>.\n","B<xlate> module can store cached text of translation for each file and read it before execution to eliminate the overhead of asking to server. With the default cache strategy C<auto>, it maintains cache data only when the cache file exists for target file. If the corresponding cache file does not exist, it does not create it.\n":"Modulul B<xlate> poate stoca în memoria cache textul traducerii pentru fiecare fișier și îl poate citi înainte de execuție, pentru a elimina cheltuielile de solicitare a serverului. Cu strategia implicită de cache C<auto>, acesta păstrează datele din cache numai atunci când fișierul cache există pentru fișierul țintă. În cazul în care fișierul cache corespunzător nu există, acesta nu este creat.\n","Kazumasa Utashiro\n":"Kazumasa Utashiro\n","Print original and translated text in L<cpp(1)> C<#ifdef> format.\n":"Tipăriți textul original și tradus în formatul L<cpp(1)> C<#ifdef>.\n"}