{"You can retrieve only Japanese text by the B<unifdef> command:\n":"Mit dem Befehl B<unifdef> können Sie nur den japanischen Text wiederherstellen:\n","Option B<--xlate> calls B<--xlate-color> option with B<--color=never> option.\n":"Die Option B<--xlate> ruft die Option B<--xlate-color> mit der Option B<--color=never> auf.\n","Print original and translated text in L<git(1)> conflict marker format.\n":"Drucken Sie den Originaltext und den übersetzten Text im Format L<git(1)> conflict marker.\n","If the format is C<none> or unkown, only translated text is printed.\n":"Wenn das Format C<none> oder unbekannt ist, wird nur der übersetzte Text gedruckt.\n","Specify the output format for original and translated text.\n":"Geben Sie das Ausgabeformat für den Originaltext und den übersetzten Text an.\n","Kazumasa Utashiro\n":"Kazumasa Utashiro\n","Then add C<--xlate> option to translate the selected area. It will find and replace them by the B<deepl> command output.\n":"Fügen Sie dann die Option C<--xlate> hinzu, um den ausgewählten Bereich zu übersetzen. Sie werden gefunden und durch die Ausgabe des Befehls B<deepl> ersetzt.\n","Pattern C<^(\\w.*\\n)+> means consecutive lines starting with alpha-numeric letter. This command show the area to be translated. Option B<--all> is used to produce entire text.\n":"Pattern C<^(\\w.*\\n)+> bedeutet aufeinanderfolgende Zeilen, die mit einem alphanumerischen Buchstaben beginnen. Dieser Befehl zeigt den zu übersetzenden Bereich an. Die Option B<--all> wird verwendet, um den gesamten Text zu übersetzen.\n","Print original and translated text separated by single blank line.\n":"Original und übersetzten Text durch eine einzelne Leerzeile getrennt ausgeben.\n","Specify the translation engine to be used. You don't have to use this option because module C<xlate::deepl> declares it as C<--xlate-engine=deepl>.\n":"Geben Sie die zu verwendende Übersetzungsmaschine an. Sie brauchen diese Option nicht zu verwenden, da das Modul C<xlate::deepl> sie als C<--xlate-engine=deepl> deklariert.\n","Never use cache file even if it exists.\n":"Niemals die Cache-Datei verwenden, selbst wenn sie vorhanden ist.\n","Maintain cache file if it exists.\n":"Cache-Datei beibehalten, wenn sie existiert.\n","This library is free software; you can redistribute it and/or modify it under the same terms as Perl itself.\n":"Diese Bibliothek ist freie Software; Sie können sie unter den gleichen Bedingungen wie Perl selbst weitergeben und/oder verändern.\n","You can use C<-Mupdate> module to modify files by the result of B<greple> command.\n":"Sie können das Modul C<-Mupdate> verwenden, um Dateien anhand des Ergebnisses des Befehls B<greple> zu ändern.\n","Specify the target language. You can get available languages by C<deepl languages> command when using B<DeepL> engine.\n":"Geben Sie die Zielsprache an. Sie können die verfügbaren Sprachen mit dem Befehl C<deepl languages> abrufen, wenn Sie die Engine B<DeepL> verwenden.\n","Copyright ©︎ 2023 Kazumasa Utashiro.\n":"Urheberrecht ©︎ 2023 Kazumasa Utashiro.\n","Without this option, B<greple> behaves as a normal search command. So you can check which part of the file will be subject of the translation before invoking actual work.\n":"Ohne diese Option verhält sich B<greple> wie ein normaler Suchbefehl. Sie können also prüfen, welcher Teil der Datei Gegenstand der Übersetzung sein wird, bevor Sie die eigentliche Arbeit aufrufen.\n","Set your authentication key for DeepL service.\n":"Legen Sie Ihren Authentifizierungsschlüssel für den Dienst DeepL fest.\n","DeepL Python library and CLI command.\n":"DeepL Python-Bibliothek und CLI-Befehl.\n","B<xlate> module can store cached text of translation for each file and read it before execution to eliminate the overhead of asking to server. With the default cache strategy C<auto>, it maintains cache data only when the cache file exists for target file. If the corresponding cache file does not exist, it does not create it.\n":"Das Modul B<xlate> kann den übersetzten Text für jede Datei im Cache speichern und vor der Ausführung lesen, um den Overhead durch Anfragen an den Server zu vermeiden. Bei der Standard-Cache-Strategie C<auto> werden Cache-Daten nur dann beibehalten, wenn die Cache-Datei für die Zieldatei existiert. Wenn die entsprechende Cachedatei nicht existiert, wird sie nicht erstellt.\n","Create empty cache file and exit.\n":"Leere Cachedatei erstellen und beenden.\n","B<Greple> B<xlate> module find text blocks and replace them by the translated text. Currently only DeepL service is supported by the B<xlate::deepl> module.\n":"B<Greple> B<xlate> Modul findet Textblöcke und ersetzt sie durch den übersetzten Text. Derzeit wird nur der DeepL Service vom B<xlate::deepl> Modul unterstützt.\n","If you want to translate entire text, use B<--match-entire> option. This is a short-cut to specify the pattern matches entire text C<(?s).*>.\n":"Wenn Sie den gesamten Text übersetzen wollen, verwenden Sie die Option B<--match-entire>. Dies ist eine Abkürzung, um das Muster für den gesamten Text C<(?s).*> anzugeben.\n","Use B<sdif> to show conflict marker format side by side with B<-V> option.\n":"Verwenden Sie B<sdif>, um das Format der Konfliktmarkierung zusammen mit der Option B<-V> anzuzeigen.\n","Command result goes to standard out, so redirect to file if necessary, or consider to use L<App::Greple::update> module.\n":"Das Ergebnis des Befehls wird im Standard-Output ausgegeben, also leiten Sie es bei Bedarf in eine Datei um oder verwenden Sie das Modul L<App::Greple::update>.\n","By default behavior, unused data is removed from cache file. If you don't want to remove them and keep in the file, use C<accumulate>.\n":"Standardmäßig werden ungenutzte Daten aus der Cache-Datei entfernt. Wenn Sie sie nicht entfernen und in der Datei behalten wollen, verwenden Sie C<accumulate>.\n","See the tranlsation result in real time in the STDERR output.\n":"Sehen Sie das Ergebnis der Übersetzung in Echtzeit in der STDERR-Ausgabe.\n","Print original and translated text in L<cpp(1)> C<#ifdef> format.\n":"Druckt den originalen und übersetzten Text im Format L<cpp(1)> C<#ifdef>.\n","Set the whole text of the file as a target area.\n":"Legen Sie den gesamten Text der Datei als Zielbereich fest.\n","If you want to translate normal text block in L<pod> style document, use B<greple> command with C<xlate::deepl> and C<perl> module like this:\n":"Wenn Sie einen normalen Textblock in einem Dokument im Stil von L<pod> übersetzen wollen, verwenden Sie den Befehl B<greple> mit dem Modul C<xlate::deepl> und C<perl> wie folgt:\n","With B<--xlate-fold> option, converted text is folded by the specified width. Default width is 70 and can be set by B<--xlate-fold-width> option. Four columns are reserved for run-in operation, so each line could hold 74 characters at most.\n":"Mit der Option B<--xlate-fold> wird der konvertierte Text um die angegebene Breite gefaltet. Die Standardbreite ist 70 und kann mit der Option B<--xlate-fold-width> eingestellt werden. Vier Spalten sind für den Einlaufvorgang reserviert, so dass jede Zeile maximal 74 Zeichen enthalten kann.\n","See the B<greple> manual for the detail about target text pattern. Use B<--inside>, B<--outside>, B<--include>, B<--exclude> options to limit the matching area.\n":"Lesen Sie das Handbuch B<greple> für Details über Zieltextmuster. Verwenden Sie die Optionen B<--inside>, B<--outside>, B<--include>, B<--exclude>, um den Suchbereich einzuschränken.\n","Invoke the translation process for each matched area.\n":"Rufen Sie den Übersetzungsprozess für jeden übereinstimmenden Bereich auf.\n","By default, original and translated text is printed in the \"conflict marker\" format compatible with L<git(1)>. Using C<ifdef> format, you can get desired part by L<unifdef(1)> command easily. Format can be specified by B<--xlate-format> option.\n":"Standardmäßig werden der ursprüngliche und der übersetzte Text im Format der \"Konfliktmarkierung\" ausgegeben, das mit L<git(1)> kompatibel ist. Wenn Sie das Format C<ifdef> verwenden, können Sie den gewünschten Teil mit dem Befehl L<unifdef(1)> leicht erhalten. Das Format kann mit der Option B<--xlate-format> angegeben werden.\n","App::Greple::xlate - translation support module for greple\n":"App::Greple::xlate - Übersetzungsunterstützungsmodul für Greple\n","You can recover the original file by next L<sed(1)> command.\n":"Sie können die Originaldatei mit dem nächsten Befehl L<sed(1)> wiederherstellen.\n","Maintain cache anyway as far as the target is normal file.\n":"Cache trotzdem beibehalten, sofern das Ziel eine normale Datei ist.\n"}