{"See the tranlsation result in real time in the STDERR output.\n":"Результат перевода можно увидеть в реальном времени в выводе STDERR.\n","Print original and translated text separated by single blank line.\n":"Вывести оригинальный и переведенный текст, разделенные одной пустой строкой.\n","Maintain cache anyway as far as the target is normal file.\n":"Сохранять кэш в любом случае, пока целевой файл является обычным файлом.\n","With B<--xlate-fold> option, converted text is folded by the specified width. Default width is 70 and can be set by B<--xlate-fold-width> option. Four columns are reserved for run-in operation, so each line could hold 74 characters at most.\n":"С опцией B<--xlate-fold> преобразованный текст сворачивается на указанную ширину. Ширина по умолчанию равна 70 и может быть задана опцией B<--xlate-fold-width>. Для обкатки зарезервировано четыре колонки, поэтому в каждой строке может содержаться не более 74 символов.\n","You can retrieve only Japanese text by the B<unifdef> command:\n":"Вы можете восстановить только японский текст командой B<unifdef>:\n","You can recover the original file by next L<sed(1)> command.\n":"Вы можете восстановить исходный файл следующей командой L<sed(1)>.\n","This library is free software; you can redistribute it and/or modify it under the same terms as Perl itself.\n":"Эта библиотека является свободным программным обеспечением; вы можете распространять ее и/или изменять на тех же условиях, что и сам Perl.\n","By default behavior, unused data is removed from cache file. If you don't want to remove them and keep in the file, use C<accumulate>.\n":"По умолчанию неиспользуемые данные удаляются из кэш-файла. Если вы не хотите удалять их и хранить в файле, используйте C<accumulate>.\n","Without this option, B<greple> behaves as a normal search command. So you can check which part of the file will be subject of the translation before invoking actual work.\n":"Без этой опции B<greple> ведет себя как обычная команда поиска. Таким образом, вы можете проверить, какая часть файла будет подвергнута переводу, прежде чем вызывать фактическую работу.\n","Use B<sdif> to show conflict marker format side by side with B<-V> option.\n":"Используйте B<sdif>, чтобы показать формат маркера конфликта бок о бок с опцией B<-V>.\n","Specify the target language. You can get available languages by C<deepl languages> command when using B<DeepL> engine.\n":"Укажите целевой язык. Вы можете получить доступные языки с помощью команды C<deepl languages> при использовании движка B<DeepL>.\n","If you want to translate entire text, use B<--match-entire> option. This is a short-cut to specify the pattern matches entire text C<(?s).*>.\n":"Если вы хотите перевести весь текст, используйте опцию B<--match-entire>. Это сокращение для указания шаблона, который соответствует всему тексту C<(?s).*>.\n","Maintain cache file if it exists.\n":"Поддерживать файл кэша, если он существует.\n","Set the whole text of the file as a target area.\n":"Установите весь текст файла в качестве целевой области.\n","Option B<--xlate> calls B<--xlate-color> option with B<--color=never> option.\n":"Опция B<--xlate> вызывает опцию B<--xlate-color> с опцией B<--color=never>.\n","App::Greple::xlate - translation support module for greple\n":"App::Greple::xlate - модуль поддержки перевода для greple\n","Print original and translated text in L<git(1)> conflict marker format.\n":"Выведите оригинальный и переведенный текст в формате маркера конфликта L<git(1)>.\n","B<Greple> B<xlate> module find text blocks and replace them by the translated text. Currently only DeepL service is supported by the B<xlate::deepl> module.\n":"Модуль B<Greple> B<xlate> находит текстовые блоки и заменяет их переведенным текстом. В настоящее время модуль B<xlate::deepl> поддерживает только сервис DeepL.\n","Specify the output format for original and translated text.\n":"Укажите формат вывода оригинального и переведенного текста.\n","If the format is C<none> or unkown, only translated text is printed.\n":"Если формат C<none> или неизвестен, печатается только переведенный текст.\n","Specify the translation engine to be used. You don't have to use this option because module C<xlate::deepl> declares it as C<--xlate-engine=deepl>.\n":"Укажите используемый механизм перевода. Эту опцию можно не использовать, поскольку в модуле C<xlate::deepl> она объявлена как C<--xlate-engine=deepl>.\n","Set your authentication key for DeepL service.\n":"Задайте ключ аутентификации для сервиса DeepL.\n","Pattern C<^(\\w.*\\n)+> means consecutive lines starting with alpha-numeric letter. This command show the area to be translated. Option B<--all> is used to produce entire text.\n":"Шаблон C<^(\\w.*\\n)+> означает последовательные строки, начинающиеся с буквенно-цифровой буквы. Эта команда показывает область, которая должна быть переведена. Опция B<--all> используется для создания всего текста.\n","By default, original and translated text is printed in the \"conflict marker\" format compatible with L<git(1)>. Using C<ifdef> format, you can get desired part by L<unifdef(1)> command easily. Format can be specified by B<--xlate-format> option.\n":"По умолчанию оригинальный и переведенный текст печатается в формате \"маркер конфликта\", совместимом с L<git(1)>. Используя формат C<ifdef>, вы можете легко получить нужную часть командой L<unifdef(1)>. Формат может быть задан опцией B<--xlate-format>.\n","If you want to translate normal text block in L<pod> style document, use B<greple> command with C<xlate::deepl> and C<perl> module like this:\n":"Если вы хотите перевести обычный текстовый блок в документе стиля L<pod>, используйте команду B<greple> с модулем C<xlate::deepl> и C<perl> следующим образом:\n","Never use cache file even if it exists.\n":"Никогда не использовать файл кэша, даже если он существует.\n","Copyright ©︎ 2023 Kazumasa Utashiro.\n":"Copyright ©︎ 2023 Kazumasa Utashiro.\n","Command result goes to standard out, so redirect to file if necessary, or consider to use L<App::Greple::update> module.\n":"Результат команды выводится в стандартный аут, поэтому при необходимости перенаправьте его в файл или воспользуйтесь модулем L<App::Greple::update>.\n","See the B<greple> manual for the detail about target text pattern. Use B<--inside>, B<--outside>, B<--include>, B<--exclude> options to limit the matching area.\n":"Подробную информацию о шаблоне целевого текста см. в руководстве B<greple>. Используйте опции B<--inside>, B<--outside>, B<--include>, B<--exclude> для ограничения области совпадения.\n","Kazumasa Utashiro\n":"Кадзумаса Утасиро\n","You can use C<-Mupdate> module to modify files by the result of B<greple> command.\n":"Вы можете использовать модуль C<-Mupdate> для модификации файлов по результатам команды B<greple>.\n","DeepL Python library and CLI command.\n":"DeepL Библиотека Python и команда CLI.\n","B<xlate> module can store cached text of translation for each file and read it before execution to eliminate the overhead of asking to server. With the default cache strategy C<auto>, it maintains cache data only when the cache file exists for target file. If the corresponding cache file does not exist, it does not create it.\n":"Модуль B<xlate> может хранить кэшированный текст перевода для каждого файла и считывать его перед выполнением, чтобы исключить накладные расходы на запрос к серверу. При стратегии кэширования по умолчанию C<auto>, он сохраняет данные кэша только в том случае, если существует файл кэша для целевого файла. Если соответствующий файл кэша не существует, он не создает его.\n","Invoke the translation process for each matched area.\n":"Запустите процесс перевода для каждой совпавшей области.\n","Create empty cache file and exit.\n":"Создать пустой файл кэша и выйти.\n","Print original and translated text in L<cpp(1)> C<#ifdef> format.\n":"Печать оригинального и переведенного текста в формате L<cpp(1)> C<#ifdef>.\n","Then add C<--xlate> option to translate the selected area. It will find and replace them by the B<deepl> command output.\n":"Затем добавьте опцию C<--xlate> для перевода выделенной области. Она найдет и заменит их на вывод команды B<deepl>.\n"}