{"Specify the target language. You can get available languages by C<deepl languages> command when using B<DeepL> engine.\n":"Määrake sihtkeel. B<DeepL> mootori kasutamisel saate saadaval olevad keeled kätte käsuga C<deepl languages>.\n","By default behavior, unused data is removed from cache file. If you don't want to remove them and keep in the file, use C<accumulate>.\n":"Vaikimisi käitumine, kasutamata andmed eemaldatakse vahemälufailist. Kui te ei soovi neid eemaldada ja failis hoida, kasutage C<accumulate>.\n","With B<--xlate-fold> option, converted text is folded by the specified width. Default width is 70 and can be set by B<--xlate-fold-width> option. Four columns are reserved for run-in operation, so each line could hold 74 characters at most.\n":"Valikuga B<--xlate-fold> volditakse teisendatud tekst määratud laiusega. Vaikimisi laius on 70 ja seda saab määrata valikuga B<--xlate-fold-width>. Neli veergu on reserveeritud sisselülitamiseks, nii et iga rida võib sisaldada maksimaalselt 74 märki.\n","Invoke the translation process for each matched area.\n":"Käivitage tõlkimisprotsess iga sobitatud ala jaoks.\n","App::Greple::xlate - translation support module for greple\n":"App::Greple::xlate - Greple tõlkimise tugimoodul\n","This library is free software; you can redistribute it and/or modify it under the same terms as Perl itself.\n":"See raamatukogu on vaba tarkvara; te võite seda levitada ja/või muuta samadel tingimustel nagu Perl ise.\n","Without this option, B<greple> behaves as a normal search command. So you can check which part of the file will be subject of the translation before invoking actual work.\n":"Ilma selle valikuta käitub B<greple> nagu tavaline otsingukäsklus. Seega saate enne tegeliku töö käivitamist kontrollida, millise faili osa kohta tehakse tõlge.\n","You can use C<-Mupdate> module to modify files by the result of B<greple> command.\n":"Saate kasutada C<-Mupdate> moodulit, et muuta faile B<greple> käsu tulemuse järgi.\n","You can recover the original file by next L<sed(1)> command.\n":"Originaalfaili saate taastada järgmise käsuga L<sed(1)>.\n","Print original and translated text in L<git(1)> conflict marker format.\n":"Trükib originaal- ja tõlgitud teksti L<git(1)> konfliktimärgistuse formaadis.\n","If the format is C<none> or unkown, only translated text is printed.\n":"Kui formaat on C<none> või tundmatu, trükitakse ainult tõlgitud tekst.\n","You can retrieve only Japanese text by the B<unifdef> command:\n":"Saate ainult jaapani teksti taastada käsuga B<unifdef>:\n","DeepL Python library and CLI command.\n":"DeepL Pythoni raamatukogu ja CLI käsk.\n","Copyright ©︎ 2023 Kazumasa Utashiro.\n":"Copyright ©︎ 2023 Kazumasa Utashiro.\n","Specify the output format for original and translated text.\n":"Määrake originaal- ja tõlgitud teksti väljundformaat.\n","B<xlate> module can store cached text of translation for each file and read it before execution to eliminate the overhead of asking to server. With the default cache strategy C<auto>, it maintains cache data only when the cache file exists for target file. If the corresponding cache file does not exist, it does not create it.\n":"B<xlate> moodul võib salvestada iga faili tõlketeksti vahemällu ja lugeda seda enne täitmist, et kõrvaldada serveri küsimisega kaasnev koormus. Vaikimisi vahemälustrateegia C<auto> puhul säilitab see vahemälu andmeid ainult siis, kui vahemälufail on sihtfaili jaoks olemas. Kui vastavat vahemälufaili ei ole olemas, ei loo ta seda.\n","Set the whole text of the file as a target area.\n":"Määrake kogu faili tekst sihtala.\n","Print original and translated text separated by single blank line.\n":"Prindi originaal- ja tõlgitud tekst ühe tühja reaga eraldatud.\n","See the B<greple> manual for the detail about target text pattern. Use B<--inside>, B<--outside>, B<--include>, B<--exclude> options to limit the matching area.\n":"Vt B<greple> käsiraamatust üksikasjalikult sihttekstimustri kohta. Kasutage B<--inside>, B<--outside>, B<--include>, B<--exclude> valikuid, et piirata sobitusala.\n","Option B<--xlate> calls B<--xlate-color> option with B<--color=never> option.\n":"Valik B<--xlate> kutsub B<--xlate-color> valikuga B<--color=never>.\n","Specify the translation engine to be used. You don't have to use this option because module C<xlate::deepl> declares it as C<--xlate-engine=deepl>.\n":"Määrake kasutatav tõlkemootor. Seda valikut ei pea kasutama, sest moodul C<xlate::deepl> deklareerib seda kui C<--xlate-engine=deepl>.\n","Command result goes to standard out, so redirect to file if necessary, or consider to use L<App::Greple::update> module.\n":"Käsu tulemus läheb standardväljundisse, nii et vajadusel suunake see faili ümber või kaaluge mooduli L<App::Greple::update> kasutamist.\n","Print original and translated text in L<cpp(1)> C<#ifdef> format.\n":"Prindi originaal- ja tõlgitud tekst L<cpp(1)> C<#ifdef>-vormingus.\n","Create empty cache file and exit.\n":"Loob tühja vahemälufaili ja väljub.\n","By default, original and translated text is printed in the \"conflict marker\" format compatible with L<git(1)>. Using C<ifdef> format, you can get desired part by L<unifdef(1)> command easily. Format can be specified by B<--xlate-format> option.\n":"Vaikimisi trükitakse originaal- ja tõlgitud tekst \"konfliktimärkide\" formaadis, mis on ühilduv L<git(1)>. Kasutades C<ifdef> formaati, saate soovitud osa hõlpsasti kätte käsuga L<unifdef(1)>. Formaat saab määrata B<--xlate-format> valikuga.\n","If you want to translate normal text block in L<pod> style document, use B<greple> command with C<xlate::deepl> and C<perl> module like this:\n":"Kui soovite L<pod> stiilis dokumendis tavalist tekstiplokki tõlkida, kasutage B<greple> käsku koos C<xlate::deepl> ja C<perl> mooduliga niimoodi:\n","Then add C<--xlate> option to translate the selected area. It will find and replace them by the B<deepl> command output.\n":"Seejärel lisage valik C<--xlate>, et tõlkida valitud ala. See leiab ja asendab need käsu B<deepl> väljundiga.\n","Never use cache file even if it exists.\n":"Ei kasuta kunagi vahemälufaili, isegi kui see on olemas.\n","Set your authentication key for DeepL service.\n":"Määrake oma autentimisvõti DeepL teenuse jaoks.\n","Pattern C<^(\\w.*\\n)+> means consecutive lines starting with alpha-numeric letter. This command show the area to be translated. Option B<--all> is used to produce entire text.\n":"Muster C<^(\\w.*\\n)+> tähendab järjestikuseid ridu, mis algavad tähtnumbrilise tähega. See käsk näitab tõlgitavat ala. Valikut B<--all> kasutatakse kogu teksti koostamiseks.\n","B<Greple> B<xlate> module find text blocks and replace them by the translated text. Currently only DeepL service is supported by the B<xlate::deepl> module.\n":"B<Greple> B<xlate> moodul leiab tekstiplokid ja asendab need tõlgitud tekstiga. Praegu toetab B<xlate::deepl> moodul ainult DeepL teenust.\n","See the tranlsation result in real time in the STDERR output.\n":"Näete tõlkimise tulemust reaalajas STDERR-väljundist.\n","Kazumasa Utashiro\n":"Kazumasa Utashiro\n","Maintain cache anyway as far as the target is normal file.\n":"Säilitab vahemälu andmed niikuinii, kui sihtfail on tavaline fail.\n","Maintain cache file if it exists.\n":"Säilitab vahemälufaili, kui see on olemas.\n","Use B<sdif> to show conflict marker format side by side with B<-V> option.\n":"Kasutage B<sdif>, et näidata konfliktimärkide formaati kõrvuti valikuga B<-V>.\n","If you want to translate entire text, use B<--match-entire> option. This is a short-cut to specify the pattern matches entire text C<(?s).*>.\n":"Kui soovite tõlkida kogu teksti, kasutage B<--match-entire> valikut. See on lühike valik, et määrata muster vastab kogu tekstile C<(?s).*>.\n"}