{"Specify the output format for original and translated text.\n":"Вкажіть формат виведення оригінального та перекладеного тексту.\n","B<Greple> B<xlate> module find text blocks and replace them by the translated text. Currently only DeepL service is supported by the B<xlate::deepl> module.\n":"Модуль B<Greple> B<xlate> знаходить текстові блоки і замінює їх перекладеним текстом. Наразі модулем B<xlate::deepl> підтримується лише сервіс DeepL.\n","If the format is C<none> or unkown, only translated text is printed.\n":"Якщо формат C<none> або невідомий, буде надруковано лише перекладений текст.\n","By default, original and translated text is printed in the \"conflict marker\" format compatible with L<git(1)>. Using C<ifdef> format, you can get desired part by L<unifdef(1)> command easily. Format can be specified by B<--xlate-format> option.\n":"За замовчуванням оригінальний і перекладений текст виводиться у форматі \"конфліктний маркер\", сумісному з L<git(1)>. Використовуючи формат C<ifdef>, ви можете легко отримати потрібну частину командою L<unifdef(1)>. Формат можна вказати за допомогою опції B<--xlate-format>.\n","With B<--xlate-fold> option, converted text is folded by the specified width. Default width is 70 and can be set by B<--xlate-fold-width> option. Four columns are reserved for run-in operation, so each line could hold 74 characters at most.\n":"За допомогою опції B<--xlate-fold> перетворений текст буде згорнуто за вказаною шириною. За замовчуванням ширина складає 70 і може бути встановлена за допомогою параметра B<--xlate-fold-width>. Чотири стовпчики зарезервовано для обкатки, тому кожен рядок може містити не більше 74 символів.\n","Then add C<--xlate> option to translate the selected area. It will find and replace them by the B<deepl> command output.\n":"Потім додайте опцію C<--xlate> для перекладу виділеної області. Вона знайде і замінить їх на виведені командою B<deepl>.\n","B<xlate> module can store cached text of translation for each file and read it before execution to eliminate the overhead of asking to server. With the default cache strategy C<auto>, it maintains cache data only when the cache file exists for target file. If the corresponding cache file does not exist, it does not create it.\n":"Модуль B<xlate> може зберігати кешований текст перекладу для кожного файлу і зчитувати його перед виконанням, щоб усунути накладні витрати на запити до сервера. При стандартній стратегії кешування C<auto> він зберігає кешовані дані лише тоді, коли для цільового файлу існує файл кешу. Якщо відповідний файл кешу не існує, він не створюється.\n","Use B<sdif> to show conflict marker format side by side with B<-V> option.\n":"Використовуйте B<sdif> для відображення формату конфліктних маркерів поряд з опцією B<-V>.\n","Option B<--xlate> calls B<--xlate-color> option with B<--color=never> option.\n":"Опція B<--xlate> викликає опцію B<--xlate-color> з опцією B<--color=never>.\n","DeepL Python library and CLI command.\n":"DeepL Бібліотека Python і команда CLI.\n","Set your authentication key for DeepL service.\n":"Встановіть свій ключ автентифікації для сервісу DeepL.\n","Print original and translated text separated by single blank line.\n":"Вивести текст оригіналу та перекладу, розділені одним порожнім рядком.\n","If you want to translate normal text block in L<pod> style document, use B<greple> command with C<xlate::deepl> and C<perl> module like this:\n":"Якщо ви хочете перекласти звичайний текстовий блок у документі в стилі L<pod>, використовуйте команду B<greple> з модулем C<xlate::deepl> і C<perl> таким чином:\n","Print original and translated text in L<git(1)> conflict marker format.\n":"Вивести оригінальний і перекладений текст у форматі конфліктних маркерів L<git(1)>.\n","Invoke the translation process for each matched area.\n":"Виклик процесу перекладу для кожної знайденої області.\n","Kazumasa Utashiro\n":"Казумаса Уташиро\n","If you want to translate entire text, use B<--match-entire> option. This is a short-cut to specify the pattern matches entire text C<(?s).*>.\n":"Якщо ви хочете перекласти весь текст, використовуйте опцію B<--match-entire>. Це швидкий спосіб вказати, що шаблон збігається з усім текстом C<(?s).*>.\n","See the tranlsation result in real time in the STDERR output.\n":"Результат перекладу у реальному часі можна побачити у виводі STDERR.\n","Pattern C<^(\\w.*\\n)+> means consecutive lines starting with alpha-numeric letter. This command show the area to be translated. Option B<--all> is used to produce entire text.\n":"Шаблон C<^(\\w.*\\n)+> означає послідовні рядки, що починаються з буквено-цифрової літери. Ця команда показує область, яку потрібно перекласти. Параметр B<--all> використовується для перекладу всього тексту.\n","App::Greple::xlate - translation support module for greple\n":"App::Greple::xlate - модуль підтримки перекладу для greple\n","By default behavior, unused data is removed from cache file. If you don't want to remove them and keep in the file, use C<accumulate>.\n":"За замовчуванням, невикористані дані видаляються з кеш-файлу. Якщо ви не хочете видаляти їх і зберігати у файлі, використовуйте C<accumulate>.\n","Set the whole text of the file as a target area.\n":"Встановити весь текст файлу як цільову область.\n","Create empty cache file and exit.\n":"Створити порожній файл кешу і вийти.\n","Never use cache file even if it exists.\n":"Ніколи не використовувати файл кешу, навіть якщо він існує.\n","Maintain cache anyway as far as the target is normal file.\n":"Зберігати кеш у будь-якому випадку, якщо цільовий файл є нормальним.\n","Command result goes to standard out, so redirect to file if necessary, or consider to use L<App::Greple::update> module.\n":"Результат команди буде виведено у стандартний вивід, тому за потреби переспрямуйте його на файл або скористайтеся модулем L<App::Greple::update>.\n","Maintain cache file if it exists.\n":"Зберігати файл кешу, якщо він існує.\n","Specify the translation engine to be used. You don't have to use this option because module C<xlate::deepl> declares it as C<--xlate-engine=deepl>.\n":"Вкажіть рушій перекладу, який буде використано. Вам не потрібно використовувати цей параметр, оскільки модуль C<xlate::deepl> оголошує його як C<--xlate-engine=deepl>.\n","This library is free software; you can redistribute it and/or modify it under the same terms as Perl itself.\n":"Ця бібліотека є вільним програмним забезпеченням; ви можете розповсюджувати її та/або змінювати на тих самих умовах, що й саму мову Perl.\n","Print original and translated text in L<cpp(1)> C<#ifdef> format.\n":"Вивести оригінальний та перекладений текст у форматі L<cpp(1)> C<#ifdef>.\n","Without this option, B<greple> behaves as a normal search command. So you can check which part of the file will be subject of the translation before invoking actual work.\n":"Без цього параметра B<greple> поводиться як звичайна команда пошуку. Таким чином, ви можете перевірити, яку частину файлу буде перекладено, перш ніж викликати процес перекладу.\n","You can retrieve only Japanese text by the B<unifdef> command:\n":"За допомогою команди B<unifdef> можна отримати лише японський текст:\n","Copyright © 2023 Kazumasa Utashiro.\n":"Copyright © 2023 Kazumasa Utashiro.\n","See the B<greple> manual for the detail about target text pattern. Use B<--inside>, B<--outside>, B<--include>, B<--exclude> options to limit the matching area.\n":"Детальніше про шаблон цільового тексту див. у посібнику B<greple>. Використовуйте опції B<--inside>, B<--outside>, B<--include>, B<--exclude> для обмеження області пошуку.\n","You can recover the original file by next L<sed(1)> command.\n":"Відновити вихідний файл можна наступною командою L<sed(1)>.\n","You can use C<-Mupdate> module to modify files by the result of B<greple> command.\n":"Ви можете скористатися модулем C<-Mupdate> для модифікації файлів за результатами виконання команди B<greple>.\n","Specify the target language. You can get available languages by C<deepl languages> command when using B<DeepL> engine.\n":"Вкажіть цільову мову. Доступні мови можна отримати за допомогою команди C<deepl languages> у разі використання рушія B<DeepL>.\n"}